{
  "currentRecipeData": [
    {
      "id": "veloute_patates_douces_curry",
      "name": "Velouté de patates douces au curry",
      "image": "/assets/salty-recipe/veloute-patates-douces.jpg",
      "eventCategory": "winter",
      "category": ["soupe", "entrée"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "d'huile",
          "quantity": "1 CS"
        },
        {
          "name": "oignon coupé en fines tranches",
          "quantity": "1"
        },
        {
          "name": "de gingembre râpé (pas en poudre, c'est important pour le goût)",
          "quantity": "1 CS"
        },
        {
          "name": "de curry en poudre ",
          "quantity": "1 CS"
        },
        {
          "name": "de coriandre fraîche ciselée",
          "quantity": "1 petite poignée"
        },
        {
          "name": "d'ail écrasées",
          "quantity": "4 gousses"
        },
        {
          "name": "de patate douce pelées et coupées en petits cubes",
          "quantity": "1 kg"
        },
        {
          "name": "de bouillon de volaille",
          "quantity": "1 litre"
        },
        {
          "name": "de lait de coco",
          "quantity": "40 cl"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "30 min",
      "steps": [
        "Faire revenir l'oignon quelques minutes dans l'huile.",
        "Ajouter l'ail, le gingembre et la poudre de curry. Remuer.",
        "Mettre les morceaux de patates douces dans ce mélange.",
        "Verser le bouillon.",
        "Porter à ébullition puis laisser mijoter à couvert pendant 20 à 30 min (jusqu'à ce que les patates soient cuites, vérifier avec la pointe d'un couteau).",
        "Enlever la casserole du feu.",
        "Laisser un peu refroidir.",
        "Mixer.",
        "Remettre sur le feu.",
        "Mettre le lait de coco et ajouter la coriandre ciselée (en garder pour mettre dans les bols au moment de servir, en décoration)."
      ]
    },
    {
      "id": "cocos_paimpol_tomate",
      "name": "Cocos de Paimpol à la tomate",
      "image": "/assets/salty-recipe/haricots-blancs-sauce-tomate.jpg",
      "eventCategory": "winter",
      "category": ["plat"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "d'haricots coco de Paimpol écossés",
          "quantity": "500g"
        },
        {
          "name": "d'uile d’olive",
          "quantity": "2 cuillères à soupe"
        },
        {
          "name": "oignon",
          "quantity": "1"
        },
        {
          "name": "gousses d’ail",
          "quantity": "2"
        },
        {
          "name": "tomates",
          "quantity": "2"
        },
        {
          "name": "de céleri branche",
          "quantity": "1 brin"
        },
        {
          "name": "de curcuma",
          "quantity": "1 pincée"
        },
        {
          "name": "de thym",
          "quantity": "3 brins"
        },
        {
          "name": "de laurier",
          "quantity": "2 feuilles"
        },
        {
          "name": "d'eau",
          "quantity": "700ml"
        },
        {
          "name": "de sel",
          "quantity": "1 pincée"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "45 min",
      "steps": [
        "Ecossez les haricots, rincez les cocos sous l’eau froide et égouttez-les.",
        "Pelez l’oignon et les gousses d’ail, et coupez-les en dés. Lavez les tomates, pelez-les et coupez-les également en dés.",
        "Ôtez les extrémités de la branche de céleri, lavez-la puis ciselez-la. Lavez le thym et le laurier.",
        "Versez l’huile d’olive dans une cocotte. Faites la chauffer puis, quand elle est chaude, ajoutez les cubes d’ail, d’oignon et de céleri.",
        "Laissez cuire 5 minutes en remuant de temps en temps puis ajoutez les tomates, le thym, le laurier et la pincée de curcuma.",
        "Mélangez et laissez légèrement compoter 5 minutes.",
        "Ajoutez ensuite les cocos égouttés et mouillez avec 700 ml d’eau.",
        "Portez à ébullition et faites cuire 30 minutes à frémissement (comptez les 30 minutes à partir du moment où cela bout).",
        "Au bout de 30 minutes, salez puis laissez cuire 10 minutes de plus."
      ]
    },

    {
      "id": "mousse_chocolat",
      "name": "Mousse au chocolat",
      "image": "/assets/sugar-recipe/mousse-chocolat.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de chocolat noir",
          "quantity": "200g"
        },
        {
          "name": "œufs",
          "quantity": "6"
        },
        {
          "name": "Sel",
          "quantity": "1 pincée"
        },
        {
          "name": "Copeaux de chocolat (facultatif)"
        }
      ],
      "prepTime": "20 min",
      "cookTime": null,
      "steps": [
        "Séparez les jaunes des blancs d’œufs.",
        "Briser le chocolat en morceaux et le mettre dans un bol. Faites-le fondre au bain-marie. Mélangez jusqu'à obtenir une consistance lisse sans grumeaux. Laissez refroidir un peu.",
        "Ajoutez les jaunes d’œufs au chocolat fondu et mélangez bien.",
        "Battez les blancs d’œufs avec une pincée de sel jusqu'à ce qu'ils deviennent fermes.",
        "Incorporez doucement les blancs d’œufs au mélange de chocolat et de jaunes d’œufs. Veillez à ne pas trop mélanger pour éviter de liquéfier la préparation.",
        "Répartissez la préparation équitablement dans 6 ramequins ou verrines.",
        "Placez les ramequins au réfrigérateur pendant au moins 3 heures pour que la mousse prenne.",
        "Pour une présentation plus élégante, vous pouvez saupoudrer les mousses de copeaux de chocolat (faites à l'aide d'un économe, assurez-vous que le chocolat soit bien froid)."
      ]
    }
  ],

  "topFoodData": [
    {
      "id": "tarte_aux_pommes",
      "name": "Tarte aux pommes",
      "image": "/assets/sugar-recipe/tarte-pommes.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "pâte brisée",
          "quantity": "1"
        },
        {
          "name": "de sucre vanillé",
          "quantity": "1 sachet"
        },
        {
          "name": "de beurre",
          "quantity": "30 g"
        },
        {
          "name": "pommes Golden",
          "quantity": "6"
        }
      ],
      "prepTime": "25 min",
      "cookTime": "30 min",
      "steps": [
        "Éplucher et découper en morceaux les pomme.",
        "Faire une compote : les mettre dans une casserole avec un peu d'eau (1 verre ou 2). Bien remuer. Quand les pommes commencent à ramollir, ajouter un sachet ou un sachet et demi de sucre vanillé. Ajouter un peu d'eau si nécessaire.",
        "Vous saurez si la compote est prête une fois que les pommes ne seront plus dures du tout. Ce n'est pas grave s'il reste quelques morceaux.",
        "Pendant que la compote cuit, éplucher et couper en quatre les deux dernières pommes, puis, couper les quartiers en fines lamelles (elles serviront à être posées sur la compote).",
        "Préchauffer le four à 210°C (thermostat 7).",
        "Laisser un peu refroidir la compote et étaler la pâte brisée dans un moule et la piquer avec une fourchette.",
        "Verser la compote sur la pâte et placer les lamelles de pommes en formant une spirale ou plusieurs cercles, au choix ! Disposer des lamelles de beurre dessus.",
        "Mettre au four et laisser cuire pendant 30 min. Surveiller la cuisson. Vous pouvez ajouter un peu de sucre vanillé sur la tarte pendant que çà cuit pour caraméliser un peu."
      ]
    },

    {
      "id": "saumon_amandes",
      "image": "/assets/salty-recipe/saumon-papillotte_2.jpg",
      "name": "Saumon aux amandes",
      "eventCategory": null,
      "servingSize": "4",
      "prepTime": "15 min",
      "cookTime": "15 min",
      "ingredients": [
        {
          "name": "pavés de saumon frais",
          "quantity": "4"
        },
        {
          "name": "de beurre",
          "quantity": "2 cc"
        },
        {
          "name": "d'amandes effilées",
          "quantity": "20g"
        },
        {
          "name": "de crème semi-épaisse",
          "quantity": "40g"
        }
      ],
      "steps": [
        "Faire cuire doucement les pavés de saumon dans une poêle antiadhésive puis les réserver au chaud.",
        "Essuyer la poêle, faire fondre la margarine et faire dorer les amandes effilées quelques instants.",
        "Ajouter la crème, saler, poivrer. Déposer le poisson, faire réduire 5 minutes.",
        "Poser le saumon par-dessus, arroser d'un filet d'huile d'olive, saler et poivrer de nouveau et ajouter une tranche de citron.",
        "Ce plat peut être accompagné de pâtes."
      ]
    },
    {
      "id": "gateau_chocolat",
      "image": "/assets/sugar-recipe/gateau-au-chocolat2.jpeg",
      "name": "Gâteau au chocolat",
      "eventCategory": null,
      "servingSize": "6",
      "prepTime": "30 min",
      "cookTime": "40 min",
      "sections": [
        {
          "name": "Fondant au chocolat",
          "ingredients": [
            {
              "name": "de chocolat pâtisier",
              "quantity": "240g"
            },
            {
              "name": "de beurre en parcelles",
              "quantity": "200g"
            },
            {
              "name": "de lait",
              "quantity": "150 ml"
            },
            {
              "name": "de farine",
              "quantity": "100g"
            },
            {
              "name": "de sucre en poudre",
              "quantity": "150g"
            },
            {
              "name": "oeufs",
              "quantity": "6"
            },
            {
              "name": "de poudre d'amande",
              "quantity": "125g"
            }
          ],
          "steps": [
            "Préchauffez le four à 160°C (th.5/6). Dans une casserole, faites fondre le chocolat avec le beurre et le lait sur feu très doux.",
            "Hors du feu, incorporez la farine et le sucre en poudre en fouettant.",
            "Fouettez les jaunes d'oeufs avec les amandes en poudre. Incorporez au mélange précédent.",
            "Fouettez les blancs en neige avec une pincée de sel. Incorporez les délicatement à la préparation précédente. Versez dans un moule à manquer beurré.",
            "Enfournez pour 1 heure."
          ]
        },
        {
          "name": "Ganache au chocolat",
          "ingredients": [
            {
              "name": "de chocolat pâtisier",
              "quantity": "100g"
            },
            {
              "name": "de crème fraîche",
              "quantity": "25cl"
            }
          ],
          "steps": [
            "Faire fondre le chocolat au bain-marie.",
            "Ajouter la crème faîche tout en mélangeant.",
            "Napper le gâteau avec une spatule dès que le mélange est homogène.",
            "Astuce: Pour un aspect bien brillant, nappez votre gâteau encore chaud."
          ]
        }
      ]
    }
  ],
  "newsData": [
    {
      "id": "courgette",
      "image": "/assets/newsCard/courgettes.webp",
      "name": "Comment conserver les courgettes?",
      "summaryTitle": [
        "Astuce n°1 : choisir des courgettes de petite taille",
        "Astuce n°2 : bien conserver les courgettes",
        "Astuce n°3 : ne pas trop cuire les courgettes",
        "Astuce n°4 : utiliser les épices après cuisson"
      ],
      "summaryText": [
        "En fonction de la taille, le goût change drastiquement. Les grosses courgettes ont en effet tendance à être plus farineuses et possèdent souvent plus de pépins ou de fibres, qui rendent les légumes plus amers. Pour des recettes réussies, il est donc préférable de choisir des courgettes de petite taille. Elles se gardent mieux à la cuisson, se digèrent facilement et leur chair est surtout plus savoureuse. Choisissez-les lourdes car c’est un signe de grande fraîcheur !",
        "Il suffit de les garder dans un endroit sec et à l'abri de la lumière comme par exemple dans la cave ou dans le garage. Ainsi, vos courgettes pourront se conserver facilement une semaine !",
        "Le temps de cuisson des courgettes est crucial pour préserver leurs qualités nutritionnelles. Une cuisson trop longue risque de les rendre molles et d’éliminer une partie de leurs vitamines et minéraux. Préférez une cuisson à la vapeur ou à l’étouffée pour les garder croquantes et pleines de saveurs. Prenez l'habitude ne pas dépasser les 8 à 10 minutes de cuisson si vous utilisez une poêle. Commencez par une cuisson à feu vif pour créer une couche croustillante sur les légumes puis baisser le feu pour cuire à l'intérieur",
        "Pour éviter que les courgettes soient sans goût comme on leur reproche souvent, il est important de bien les assaisonner. Mais attention, l’astuce pour libérer le maximum de saveur, c’est de les assaisonner seulement après la cuisson ! Il est préférable d'attendre que l'eau de cuisson se soit évaporée avant de vous lancer dans l'assaisonnement. Sel, poivre, paprika, piment d'Espelette ou même curry, laissez libre cours à votre imagination!"
      ]
    },
    {
      "id": "tomate",
      "image": "/assets/newsCard/tomates.jpg",
      "name": "Comment conserver les tomates?",
      "summaryTitle": [
        "Ne pas placer les tomates au frigo",
        "Comment bien conserver les tomates ?",
        "Utilisation d'un sac en papier",
        "Lavage au moment de la consommation",
        "Conservation des tomates mûres"
      ],
      "summaryText": [
        "Pour prolonger leur fraîcheur, nous avons tendance à les placer au frigo. Le problème est que le froid casse les saveurs de la tomate. Plus elle reste au froid, moins elle a de goût.",
        "Il faut plutôt les conserver dans un endroit sec, à l’abri de la lumière. La température ambiante leur permet de mûrir doucement et de garder toute leur saveur.",
        "Une astuce simple et efficace consiste à placer les tomates dans un sac en papier et d’y ajouter une pomme. La pomme, en murissant, émet du gaz éthylène, ce qui accélère le murissement des tomates.",
        "Il est préférable de laver les tomates uniquement au moment où vous allez les consommer. En effet, en les lavant trop tôt, elles deviennent humides et peuvent développer des moisissures.",
        "Pour les tomates déjà mûres, il est possible de les conserver dans un récipient hermétique avec un couvercle au réfrigérateur. Pensez à les sortir quelques heures avant consommation pour qu’elles retrouvent leur saveur."
      ]
    },
    {
      "id": "viande",
      "image": "/assets/newsCard/viande.jpg",
      "name": "Faut-il décongeler sa viande avant de la cuire ?",
      "summaryTitle": [
        "Pourquoi faut-il la décongeler avant ?",
        "Perte de jus et de saveur"
      ],
      "summaryText": [
        "Il est important de prendre le temps de décongeler sa viande, avant cuisson, pour plusieurs raisons. En premier lieu, une viande congelée va prendre bien plus de temps à cuire et risque d'être mal cuite à l'intérieur. Si vous mettez une escalope de poulet congelée dans la poêle et que vous la retournez, vous risquez de cuire uniquement l'extérieur et vous retrouver avec une chair crue ou encore froide. De plus, le risque de contamination par les bactéries qu'elle contient est plus élevé.",
        "Cuire la viande lorsqu'elle est encore congelée peut provoquer une perte plus importante des jus naturels de la viande. Cela peut rendre la viande plus sèche et diminuer sa saveur."
      ]
    },
    {
      "id": "gourde",
      "image": "/assets/newsCard/gourdes.jpg",
      "name": "Mauvaises odeurs dans une gourde, comment s'en débarrasser?",
      "summaryTitle": [
        "Pourquoi est-il important de nettoyer sa gourde et à quelle fréquence faut-il le faire ?",
        "Comment nettoyer sa gourde efficacement ?"
      ],
      "summaryText": [
        [
          "L'absence d'un nettoyage régulier de la gourde peut être nuisible à la santé, car les restes de boissons et les bactéries créent un environnement propice à la prolifération de germes et de moisissures, responsables des mauvaises odeurs. Consommer des liquides d'une gourde mal entretenue peut causer des troubles gastro-intestinaux et affecter le goût des boissons. Pour maintenir la gourde en bon état, il est conseillé de la laver tous les jours, de préférence après chaque utilisation, et de s'assurer qu'elle soit complètement sèche avant de la remplir à nouveau."
        ],
        [
          "1. Démontez la gourde, en enlevant le bouchon, le bec verseur, et tout autre élément amovible.",
          "2. Faites un prélavage avec de l'eau chaude et du savon en frottant l'intérieur et l'extérieur de la gourde et de ses pièces démontées avec une brosse ou une éponge.",
          "3. Pour éliminer les odeurs tenaces, remplissez la gourde d'eau chaude avec du vinaigre blanc, du bicarbonate de soude, du jus de citron ou quelques gouttes d'huile essentielle, et laissez agir quelques heures avant de rincer.",
          "4. Rincez la gourde à l'eau claire pour enlever les résidus de savon et des solutions odorantes.",
          "5. Laissez toutes les parties de la gourde sécher complètement à l'air libre ou avec un chiffon propre, en portant une attention particulière aux joints et aux zones difficiles à atteindre pour éviter la croissance de moisissures."
        ]
      ]
    },
    {
      "id": "ratatouille",
      "image": "/assets/newsCard/ratatouille.jpg",
      "name": "Astuces efficaces pour éviter que la ratatouille soit trop liquide",
      "summaryTitle": [
        "Astuce n°1 : Cuire les légumes en plusieurs temps",
        "Astuce n°2 : Faire dégorger les légumes"
      ],
      "summaryText": [
        "Pour préparer une ratatouille savoureuse sans que les légumes ne deviennent de la bouillie ou rendent trop d'eau, il est recommandé de les cuire séparément. Dans une poêle avec de l'huile d'olive, cuisez chaque type de légume jusqu'à ce qu'il atteigne la consistance désirée et que son eau se soit évaporée. Si nécessaire, égouttez-les après cuisson. Une fois que tous les légumes sont cuits individuellement, combinez-les dans la poêle. Ajoutez un peu d'huile d'olive, des herbes de Provence, du sel, et du poivre, puis faites cuire ensemble pendant quelques minutes. Cela vous permettra d'obtenir une ratatouille aux textures idéales et pleine de saveurs.",
        "Pour prévenir l’excès d’eau dans la ratatouille provenant des légumes, il est astucieux de les faire dégorger. Après les avoir coupés, placez-les dans une passoire, saupoudrez-les de sel, et laissez-les reposer pendant au moins 30 minutes. Ensuite, utilisez du papier absorbant pour les essuyer. Il est judicieux de commencer par les légumes qui requièrent une cuisson plus longue comme l’aubergine, tandis que d'autres dégorgent. Pour les tomates, qui contiennent beaucoup d'eau, retirez les pépins avant de les ajouter à la ratatouille."
      ]
    },
    {
      "id": "repas_ete",
      "image": "/assets/newsCard/eat_food.jpg",
      "name": "Pourquoi a-t-on moins d'appétit quand il fait chaud ?",
      "summaryTitle": [
        "Pourquoi la chaleur diminue l’appétit en été ?",
        "Que faire pour bien s’alimenter en été ?"
      ],
      "summaryText": [
        "Durant les fortes chaleurs, le corps humain a tendance à être plus inactif et à conserver son énergie, car les activités et l’agitation peuvent augmenter la sensation de chaleur. En été, le corps n’a pas besoin de dépenser beaucoup d'énergie pour maintenir sa température interne, contrairement à l'winter où il lutte pour se réchauffer. De ce fait, les besoins énergétiques diminuent et, par un mécanisme d'auto-régulation, l'appétit se réduit naturellement, ce qui rend les repas copieux moins attrayants. Ce phénomène est particulièrement notable chez les enfants, qui ont tendance à être moins actifs et donc à ressentir moins la faim lorsque les températures sont élevées.",
        "Pour assurer un régime alimentaire équilibré sans carences pendant les jours chauds, optez pour des repas froids et rafraîchissants. Les salades variées, les crudités et les sandwichs froids sont d'excellentes options pour toute la famille. Pour satisfaire les enfants ou les amateurs de sucreries, envisagez des desserts glacés, comme la glace au yaourt et aux framboises fait maison.En outre, il est crucial de ne pas négliger l'hydratation. Consommer suffisamment d'eau est essentiel, surtout pendant les périodes de chaleur."
      ]
    },
    {
      "id": "bienfaits_eau_citronnee",
      "image": "/assets/newsCard/eau_citron.jpg",
      "name": "L'eau citronnée : un trésor pour votre santé",
      "summaryTitle": [
        "1. L’eau citronnée favorise l’hydratation",
        "2. L’eau citronnée est une bonne source de vitamine C",
        "3. L’eau citronnée peut favoriser la perte de poids",
        "4. L’eau citronnée peut aider à la digestion",
        "5. L’eau citronnée purifie et détoxifie l’organisme",
        "6. Astuce avec du curcuma"
      ],
      "summaryText": [
        [
          "L'eau citronnée est un moyen délicieux et rafraîchissant pour augmenter votre apport en eau et assurer une hydratation optimale de votre corps.",
          "L'ajout de jus de citron à votre eau pour en rehausser le goût peut vous inciter à boire plus.",
          "Elle fournit à votre corps le liquide essentiel ainsi que des minéraux tels que le potassium, le calcium, le magnésium, et des éléments comme le fer et la vitamine A."
        ],
        [
          "Les fruits citriques comme le citron sont riches en vitamine C, un antioxydant qui protège les cellules contre les radicaux libres.",
          "L'eau citronnée possède des propriétés antibactériennes et anti-inflammatoires et renforce le système immunitaire."
        ],
        [
          "Le jus de citron peut aider à la perte de poids grâce à ses multiples propriétés, notamment en aidant à la détoxification du corps et en favorisant la digestion.",
          "Plusieurs études ont démontré que boire de l'eau citronnée avant les repas peut être une stratégie efficace pour la perte de poids."
        ],
        [
          "Consommer de l'eau citronnée avant les repas peut stimuler et améliorer la digestion.",
          "Des recherches ont révélé que l'acide citrique dans le jus de citron stimule la production d'acide gastrique, un liquide digestif sécrété dans l'estomac qui aide le corps à décomposer et à digérer plus efficacement les aliments."
        ],
        [
          "L'eau citronnée aide à maintenir l'équilibre acido-basique, c'est-à-dire à réguler le pH de notre corps.",
          "Cela signifie que si vous avez consommé une grande quantité de viande ou d'autres aliments acides récemment, l'eau citronnée peut vous aider à rétablir l'équilibre acido-basique de votre corps.",
          "Elle a un léger effet diurétique qui favorise l'élimination des substances toxiques via l'urine."
        ],
        [
          "Ajoutez à votre jus de citron chaud ½ cuiller à café de curcuma en poudre puis dégustez.."
        ]
      ]
    },
    {
      "id": "melon",
      "image": "/assets/newsCard/melon.jpg",
      "name": "Comment cuisiner un melon fade et sans goût?",
      "summaryTitle": [
        "Votre melon est fade ou sans goût ?",
        "1. Salade de melon et jambon de Parme",
        "2. Smoothie au melon",
        "3. Sorbet au melon",
        "4. Gaspacho de melon",
        "5. Brochettes de fruits",
        "6. Salade de melon et feta",
        "7. Melon grillé",
        "8. Salsa de melon",
        "9. Infusion d'eau au melon",
        "10. Confiture de melon"
      ],
      "summaryText": [
        "Pas la peine de le jeter ! Voici des astuces simples et gourmandes pour lui redonner du peps et tout un tas de saveurs !",
        "Découpez le melon en morceaux et servez-le avec du jambon de Parme. La combinaison de la douceur du melon et de la salinité du jambon peut améliorer le goût du melon.",
        "Mélangez le melon avec d'autres fruits (comme des fraises, des bananes ou des pêches), du yaourt, et un peu de miel ou de sirop d'érable pour ajouter de la douceur.",
        "Réduisez le melon en purée avec un peu de jus de citron, de sucre et d'eau. Congelez le mélange, en remuant de temps en temps pour casser les cristaux de glace, jusqu'à ce qu'il soit ferme.",
        "Créez une variation rafraîchissante du gaspacho traditionnel en utilisant du melon, des concombres, de l'huile d'olive, du vinaigre et des herbes.",
        "Utilisez le melon comme ingrédient dans des brochettes de fruits. Mélangez-le avec d'autres fruits et arrosez de jus de citron ou de lime, et un peu de miel.",
        "Combiner le melon avec de la feta émiettée, de la menthe fraîche, du jus de citron et un filet d'huile d'olive. La feta ajoutera du sel qui peut aider à rehausser la saveur du melon.",
        "Coupez le melon en tranches épaisses et grillez-le rapidement de chaque côté. Cela peut caraméliser certains des sucres naturels et ajouter de la profondeur de saveur.",
        "Faites une salsa avec du melon, de la tomate, de l'oignon, du jus de citron vert, de la coriandre et des piments. Servez avec des chips ou comme garniture pour des tacos ou du poisson grillé.",
        "Ajoutez des morceaux de melon dans une carafe d'eau avec des tranches de citron, de concombre et des feuilles de menthe pour une eau aromatisée.",
        "Faites une confiture en mélangeant le melon avec du sucre et du jus de citron, puis en le cuisant à feu doux jusqu'à ce qu'il épaississe."
      ]
    }
  ],
  "antiWasteTipsData": [
    {
      "id": "fraise",
      "image": "/assets/antiWasteTips/sirop-de-fraise.jpg",
      "name": "Sirop de queues de fraises",

      "detailText": "Pour réaliser ce sirop, il vous faudra environ 50g de queues de fraises avec un peu de chair de fraises. Ce sirop se conserve plusieurs jours au réfrigérateur et il est particulièrement délicieux avec une eau bien fraîche ou de la limonade, du citron vert et de la menthe.",
      "servingSize": "6",
      "prepTime": "5 min",
      "cookTime": "25 min",
      "ingredients": [
        {
          "name": "de queues de fraises avec un peu de chair",
          "quantity": "60 g"
        },
        {
          "name": "de sucre en poudre",
          "quantity": "80 g"
        },
        {
          "name": "de jus de citron",
          "quantity": "1 cuillère à soupe"
        },
        {
          "name": "d'eau",
          "quantity": "125 ml"
        }
      ],

      "steps": [
        "Mélanger tous les ingrédients dans une casserole.",
        "Faire chauffer à feu doux et mélanger régulièrement.",
        "Lorsque le sucre est dissous, poursuivre la cuisson pendant 20 min à couvert.",
        "Au fur et à mesure, la consistance de l'eau va s'épaissir et obtenir une consistance de plue en plus rouge.",
        "Retirer du feu une fois que vous obtenez un sirop bien épais.",
        "Filtrez le sirop obtenu avec un tamis pour enlever les queues et les débris laissés pendant la cuisson.",
        "Laisser refroidir avant de verser dans une bouteille ou un bocal stérilisé.",
        "Placer au réfrigérateur.",
        "Servir : 15 ml de sirop pour 300 ml d’eau."
      ]
    },
    {
      "id": "cerise",
      "image": "/assets/antiWasteTips/tisane-queue-de-cerise.jpg",
      "name": "Tisane de queues de cerises",

      "detailText": "Les queues de cerise possèdent de nombreuses vertus, notamment au niveau du transit intestinal. Elles permettent de drainer l’organisme et de le détoxifier, agissant comme un dépuratif naturel. La parfaite infusion pour retrouver un ventre plat ! Grâce à sa teneur en sels de potassium et polyphénols, la tisane aux queues de cerises permet aussi de lutter contre certaines affections urinaires.",
      "servingSize": "2",
      "prepTime": "5 min",
      "cookTime": "5 min",
      "ingredients": [
        {
          "name": "de queues de cerises",
          "quantity": "4 cuillères à soupe"
        },
        {
          "name": "d'eau",
          "quantity": "500 ml"
        }
      ],
      "steps": [
        "Faites bouillir 500 ml d’eau.",
        "Versez les queues, rincées au préalable, dans l’eau bouillante.",
        "Couvrez et laissez infuser 5 bonnes min.",
        "Filtrez et dégustez pour profiter de tous les bienfaits de cette boisson "
      ]
    },
    {
      "id": "epluchures-pomme",
      "image": "/assets/antiWasteTips/epluchures-pomme.jpg",
      "name": "Chips d'épluchures de pomme",

      "detailText": "Ne jetez plus vos épluchures de pomme! Transformez-les en délicieux chips croustillants. C'est une collation saine et sans gaspillage, parfaite pour grignoter sans culpabilité.",

      "servingSize": "2",
      "prepTime": "10 min",
      "cookTime": "2 heures",
      "ingredients": [
        {
          "name": "pommes",
          "quantity": "4"
        },
        {
          "name": "sucre en poudre",
          "quantity": "2 CS"
        },
        {
          "name": "cannelle en poudre",
          "quantity": "1 cc"
        }
      ],

      "steps": [
        "Préchauffez votre four à 110°C (Th. 1/4).",
        "Mélangez le sucre en poudre et la cannelle dans un petit bol.",
        "Placez les épluchures de pomme sur une plaque de cuisson recouverte de papier sulfurisé.",
        "Saupoudrez les épluchures de pomme avec le mélange de sucre et de cannelle.",
        "Enfournez pendant environ 2 heures, ou jusqu'à ce que les épluchures soient croustillantes.",
        "Laissez-les refroidir avant de les déguster."
      ]
    },
    {
      "id": "marc-cafe",
      "image": "/assets/antiWasteTips/marc-cafe-gommage.jpg",
      "name": "Gommage pour le corps au marc de café",

      "detailText": "Le marc de café peut être utilisé comme un excellent exfoliant naturel pour le corps. Il aide à éliminer les cellules mortes de la peau, améliore la circulation et laisse la peau douce et lisse.",

      "servingSize": "1",
      "prepTime": "5 min",
      "cookTime": "0 min",
      "ingredients": [
        {
          "name": "Marc de café",
          "quantity": "1 tasse"
        },
        {
          "name": "Huile de coco",
          "quantity": "1/4 tasse"
        },
        {
          "name": "Sucre",
          "quantity": "2 cuillères à soupe"
        }
      ],

      "steps": [
        "Mélangez le marc de café, l'huile de coco et le sucre dans un bol jusqu'à obtenir une pâte homogène.",
        "Sous la douche, appliquez le gommage sur votre peau en effectuant des mouvements circulaires.",
        "Rincez abondamment à l'eau tiède.",
        "Séchez votre peau en la tamponnant doucement avec une serviette."
      ]
    },
    {
      "id": "bouillon-epeluchures",
      "image": "/assets/antiWasteTips/bouillon-epluchures.jpg",
      "name": "Bouillon de légumes avec épluchures",

      "detailText": "Utilisez les épluchures et restes de légumes pour préparer un bouillon maison savoureux. Cela inclut les bouts de carottes, les tiges de céleri, les peaux d'oignon, etc.",

      "servingSize": "4",
      "prepTime": "10 min",
      "cookTime": "1 heure",
      "ingredients": [
        {
          "name": "épluchures et restes de légumes",
          "quantity": "2 tasses"
        },
        {
          "name": "eau",
          "quantity": "6 tasses"
        },
        {
          "name": "Sel",
          "quantity": "1 pincée"
        },
        {
          "name": "Poivre",
          "quantity": "1 pincée"
        }
      ],

      "steps": [
        "Laver avec une brosse les légumes.",
        "Les éplucher puis mettez les épluchures et les restes de légumes dans une grande casserole.",
        "Ajoutez l'eau.",
        "Portez à ébullition, puis réduisez le feu et laissez mijoter pendant 1 heure.",
        "Filtrez le bouillon à travers une passoire fine et assaisonnez avec du sel et du poivre.",
        "Utilisez-le comme base pour des soupes ou des ragoûts, ou congelez-le pour une utilisation ultérieure.",
        "Astuce : Si on cuit les ingrédients, départ au froide, ils donneront tous leurs nutriments au bouillon. Il est donc préférable de mettre les ingrédients dans l’eau froide."
      ]
    },
    {
      "id": "hachi_parmentier_pot_au_feu",
      "image": "/assets/antiWasteTips/hachi-parmentier-pot-au-feu.jpg",
      "name": "Hachi-parmentier avec restes de pot-au-feu",
      "detailText": "Une délicieuse façon de réutiliser les restes de votre pot-au-feu.",
      "servingSize": "6",
      "prepTime": "20 min",
      "cookTime": "40 min",
      "ingredients": [
        {
          "name": "de reste de viande de pot au feu hâché grossièrement",
          "quantity": "400 g"
        },
        {
          "name": "cube de bouillon pour pot-au-feu",
          "quantity": "1"
        },
        {
          "name": "de pommes de terre à chaire farineuse",
          "quantity": "1.3 kg"
        },
        {
          "name": "de beurre",
          "quantity": "40 g"
        },
        {
          "name": "gruyère râpé",
          "quantity": null
        },
        {
          "name": "sel",
          "quantity": null
        },
        {
          "name": "poivre",
          "quantity": null
        }
      ],
      "steps": [
        "Cuire les pommes de terre. Les égoutter puis les éplucher.",
        "Les écraser au presse-purée puis les remettre dans la casserole pour les dessécher un peu. Ajouter le beurre ainsi que 2 louches de bouillon.",
        "Chauffer la viande dans une grande poêle avec un peu de bouillon.",
        "Étaler la viande dans un plat allant au four. Répartir la purée par-dessus et parsemer de gruyère râpé.",
        "Faire gratiner au four."
      ]
    }
  ],

  "regularRecipes": [
    {
      "id": "brioche_sucre",
      "name": "Brioche au sucre",
      "image": "/assets/sugar-recipe/brioche.png",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de beurre ramolli",
          "quantity": "75g"
        },
        {
          "name": "de lait",
          "quantity": "175ml"
        },
        {
          "name": "de farine",
          "quantity": "350g"
        },
        {
          "name": "de sucre en poudre",
          "quantity": "40g"
        },
        {
          "name": "de sucre vanillé",
          "quantity": "1 sachet"
        },
        {
          "name": "oeuf",
          "quantity": "1"
        },
        {
          "name": "Levure spéciale boulangerie"
        },
        {
          "name": "Sel",
          "quantity": "1 pincée"
        },
        {
          "name": "Sucre en grains",
          "quantity": "1 CS"
        }
      ],
      "prepTime": "3 h 40 min",
      "cookTime": "25 min",
      "steps": [
        "Dans un saladier, mélangez la farine, le sucre et le sel, puis faites un puit.",
        "Ajoutez la levure. Attention, la levure ne doit pas être en contact direct avec le sel, sinon la brioche ne gonflera pas.",
        "Versez lentement le lait tiède, l'oeuf et le beurre ramolli.",
        "Pétrissez à la main ou au robot afin d'obtenir une pâte bien lisse.",
        "Recouvrez le plat dans lequel vous avez mis la pâte et laissez reposer une nuit au réfrigérateur.",
        "Séparez la pâte en 3 boules, puis sur un plan fariné, façonnez chacunes d'elles en pâtons.",
        "Formez une tresse en prenant soin de bien sceller chaque côté. Recouvrez d'un linge et laissez reposer 3 h à température ambiante.",
        "Une fois que la brioche a triplé de volume, badigeonnez-la de lait puis recouvrez de grains de sucre.",
        "Enfournez dans un four bien chaud (180°C) pendant 30min. La brioche est cuite lorsqu'elle est bien dorée",
        "Variante : Vous pouvez ajouter des pépites de chocolat dans la pâte"
      ]
    },
    {
      "id": "chouquettes",
      "name": "Chouquettes au sucre perlé",
      "image": "/assets/sugar-recipe/chouquettes.webp",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de farine",
          "quantity": "150g"
        },
        {
          "name": "de beurre",
          "quantity": "100g"
        },
        {
          "name": "de sucre en poudre",
          "quantity": "15g"
        },
        {
          "name": "sel",
          "quantity": null
        },
        {
          "name": "oeuf",
          "quantity": "4"
        },
        {
          "name": "d'eau",
          "quantity": "25 cl"
        },
        {
          "name": "de sucre en grain",
          "quantity": "150g"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "30 min",
      "steps": [
        "Porter à ébullition l'eau avec le beurre, le sucre et le sel dans une casserole.",
        "Retirer du feu et ajouter la farine d'un sel coup, mélanger énergiquement pour obtenir un mélange homogène.",
        "Remettre la pâte sur le feu pour l'assécher, elle doit se décoller des bords de la casserole.",
        "Incorporer alors les oeufs un à un en remuant bien entre chaque.",
        "Déposer des petits tas de pâte espacés sur la plaque à pâtisserie beurrée à l'aide d'une poche à douille ou de 2 cuillères.",
        "Saupoudrer de sucre perlé et secouer la plaque pour retirer l'excédent de sucre.",
        "Recommencer l'opération, et laisser de côté le sucre qui n'a pas accroché aux choux.",
        "Faire cuire les chouquettes environ 30 min dans le four à 210°C (thermostat 7), dans le bas du four.",
        "Laissez-les refroidir dans le four éteint et déguster."
      ]
    },
    {
      "id": "cookie",
      "name": "Cookies aux pépites de chocolat",
      "image": "/assets/sugar-recipe/cookies.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "oeuf",
          "quantity": "1"
        },
        {
          "name": "de vergeoise brune",
          "quantity": "85g"
        },
        {
          "name": "de beurre",
          "quantity": "85g"
        },
        {
          "name": "de farine",
          "quantity": "150g"
        },
        {
          "name": "de pépites de chocolat",
          "quantity": "100g"
        },
        {
          "name": "de sucre vanillé",
          "quantity": "1 sachet"
        },
        {
          "name": "de levure chimique",
          "quantity": "1 cc"
        },
        {
          "name": "de sel",
          "quantity": "1 pincée"
        }
      ],
      "prepTime": "25 min",
      "cookTime": "10 min",
      "steps": [
        "Laissez ramollir le beurre à température ambiante. Dans un saladier, malaxez-le avec le sucre.",
        "Ajoutez l'oeuf et le sucre vanillé.",
        "Versez progressivement la farine, la levure chimique, le sel et les pépites de chocolat. Mélangez bien.",
        "Beurrez une plaque allant au four ou recouvrez-le d'une feuille de papier sulfutisé. A l'aide de 2 cuillères, à soupe ou simplement avec les mains, formez des noix de pâte en les espaçant car elles s'étalant à la cuisson.",
        "Faire cuire 8 à 10 min à 180°C soit thermostat 6. Il faut les sortir dès que les contours commencent à brunir."
      ]
    },
    {
      "id": "crepe",
      "name": "Crêpes sucrées",
      "image": "/assets/sugar-recipe/crepes.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de farine",
          "quantity": "250g"
        },
        {
          "name": "de lait demi-écrémé",
          "quantity": "50 cl"
        },
        {
          "name": "oeufs",
          "quantity": "3"
        },
        {
          "name": "de sucre vanillé",
          "quantity": "1 sachet"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "15 min",
      "steps": [
        "Versez la farine dans un saladier. Faire un puit",
        "Ajoutez les oeufs.",
        "Mélangez à l'aide d'un fouet en délayant tout doucement avec le lait, afin d'éviter les grumeaux.",
        "Ajoutez le sucre vanillé.",
        "Laissez reposer la pâte 1 heure environ",
        "Vous pouvez ajouter un peu d'eau si la pâte vous parait trop épaisse."
      ]
    },
    {
      "id": "far",
      "name": "Far breton aux pruneaux",
      "image": "/assets/sugar-recipe/far-breton.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "8",
      "ingredients": [
        {
          "name": "de farine",
          "quantity": "125g"
        },
        {
          "name": "de sucre",
          "quantity": "80g"
        },
        {
          "name": "de lait demi-écrémé",
          "quantity": "50cl"
        },
        {
          "name": "oeufs",
          "quantity": "3"
        },
        {
          "name": "pruneaux dénoyautés",
          "quantity": "12"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "30 min",
      "steps": [
        "Mélangez les oeufs et le sucre au fouet, jusqu'à ce que le mélange blanchisse.",
        "Ajoutez la farine. Mélangez.",
        "Ajoutez le lait chaud. Mélangez jusqu'à ce que la pâte soit bien lisse.",
        "Beurrez un plat allant au four, ajoutez-y les pruneaux. Versez la pâte sur la préparation.",
        "Mettez le plat dans un four préalablement chauffé à 200°C.",
        "Laissez cuire environ 30 min. Le far est cuit quand la croûte a bien brunie."
      ]
    },
    {
      "id": "creme_carambar",
      "name": "Crème dessert au carambar",
      "image": "/assets/sugar-recipe/creme-aux-carambar.webp",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "carambars",
          "quantity": "10"
        },
        {
          "name": "de lait demi-écrémé",
          "quantity": "50cl"
        },
        {
          "name": "oeufs",
          "quantity": "2"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "45 min",
      "steps": [
        "Faire fondre les carambars dans le lait dans une casserole.",
        "Pendant ce temps, dans un saladier, battre les oeufs.",
        "Lorsque les carambars sont fondus, ajouter le lait dans le saladiers et bien mélanger.",
        "Verser la préparation dans les ramequins.",
        "Disposer les ramequins dans un plat à gratin avec de l'eau dedans, pour faire cuire au bain-marie.",
        "Mettre à four chaud pendant 45 min à 175°",
        "Sortir du four et laisser refroidir"
      ]
    },
    {
      "id": "creme_chocolat",
      "name": "Crème dessert au chocolat",
      "image": "/assets/sugar-recipe/creme-chocolat.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de chocolat noir pâtissier",
          "quantity": "100g"
        },
        {
          "name": "de lait demi-écrémé",
          "quantity": "50cl"
        },
        {
          "name": "de maïzena (fécule de maïs)",
          "quantity": "30g"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "10 min",
      "steps": [
        "Verser la maïzena dans le lait froid et fouettez.",
        "Concassez grossièrement le chocolat à l'aide d'un couteau.",
        "Dans une casserole,faites fondre à feu doux le chocolat dans le lait. Mélangez doucement sans arrêt, jusqu'à ce que la crème s'épaississe. Fouettez-la quelques instants pour qu'elle devienne bien lisse.",
        "Répartissez la crème dans les petits ramequins, laissez poser pendant 2 h, puis réservez au réfrigérateur jusqu'au moment de servir."
      ]
    },
    {
      "id": "creme_speculos",
      "name": "Crème dessert au speculos",
      "image": "/assets/sugar-recipe/creme-aux-speculoos.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de lait",
          "quantity": "500 ml"
        },
        {
          "name": "spéculos",
          "quantity": "8"
        },
        {
          "name": "de maïzena",
          "quantity": "4 CS"
        },
        {
          "name": "de sucre en poudre",
          "quantity": "2 CS"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "10 min",
      "steps": [
        "Délayez la maïzena dans un peu de lait.",
        "Ajoutez le sucre puis le lait petit à petit. Bien mélanger.",
        "Mettre les speculos entre 2 feuilles de sopalin, et les écraser avec un rouleau a pâtisserie.",
        "Ajoutez les spéculos écrasés dans la préparation.",
        "Faites chauffer la préparation dans une casserole jusqu'à ébullition, tout en mélangeant.",
        "Répartir la crème dans les pots, laissez refroidir et les placer au réfrigérateur",
        "Au moment de servir, émiettez 1/2 spéculos sur chaque dessert"
      ]
    },
    {
      "id": "creme_vanille",
      "name": "Crème dessert à la vanille",
      "image": "/assets/sugar-recipe/creme-vanille.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de lait",
          "quantity": "500 ml"
        },
        {
          "name": "de sucre vanillé",
          "quantity": "2 sachets"
        },
        {
          "name": "de maïzena",
          "quantity": "30g"
        },
        {
          "name": "de sucre en poudre",
          "quantity": "60g"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "10 min",
      "steps": [
        "Délayez la maïzena dans un peu de lait.",
        "Ajoutez le sucre et le sucre vanillé puis le lait petit à petit. Bien mélanger.",
        "Faites chauffer la préparation dans une casserole jusqu'à ébullition, tout en mélangeant, jusqu'à ce que la crème s'épaississe.",
        "Répartir la crème dans les pots, laissez refroidir et les placer au réfrigérateur"
      ]
    },
    {
      "id": "riz_au_lait_caramel",
      "name": "Riz au lait au caramel",
      "image": "/assets/sugar-recipe/riz-au-lait.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de riz rond",
          "quantity": "120g"
        },
        {
          "name": "de lait demi-écrémé",
          "quantity": "1 litre"
        },
        {
          "name": "de caramel liquide",
          "quantity": "6 cc"
        },
        {
          "name": "de sucre",
          "quantity": "50g"
        },
        {
          "name": "de sucre vanillé",
          "quantity": "2 sachets"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "30 à 40 min",
      "steps": [
        "Faire chauffer le lait dans une casserole.",
        "Ajouter le riz rond.",
        "Ajouter le sucre et le sucre vanillé ou la gousse de vanille",
        "Cuire à feu doux tout en remuant très régulièrement, jusqu'à ce que la préparation devienne onctueuse.",
        "Verser un peu de caramel liquide dans les ramequins.",
        "Puis, verser la préparation de riz au lait dans des ramequins.",
        "Laisser refroidir."
      ]
    },
    {
      "id": "semoule_caramel",
      "name": "Semoule au caramel",
      "image": "/assets/sugar-recipe/semoule-au-caramel.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de semoule fine",
          "quantity": "60g"
        },
        {
          "name": "jaune d'oeuf",
          "quantity": "1"
        },
        {
          "name": "de sucre",
          "quantity": "40g"
        },
        {
          "name": "de sucre vanillé",
          "quantity": "2 sachets"
        },
        {
          "name": "de lait",
          "quantity": "500ml"
        },
        {
          "name": "de caramel liquide",
          "quantity": "4 cc"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "30 min",
      "steps": [
        "Faire chauffer le lait. Ajouter la semoule en pluie. Laisser épaissir sans cesser de remuer.",
        "Mélangez au fouet le jaune d'oeuf le sucre et le sucre vanillé. Versez le mélange semoule/lait puis mélangez.",
        "Versez le caramel au fond des ramequins. Y verser la préparation de semoule.",
        "Mettre les ramequins dans un plat allant au four et verser un fond d'eau dans le plat pour une cuisson au four au bain-marie.",
        "Laisser cuire environ 30 min au four. Se mange bien frais"
      ]
    },
    {
      "id": "cake_citron",
      "name": "Cake au citron avec glaçage",
      "image": "/assets/sugar-recipe/cake-au-citron.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de beurre fondu",
          "quantity": "120g"
        },
        {
          "name": "oeufs",
          "quantity": "3"
        },
        {
          "name": "de sucre en poudre",
          "quantity": "200g"
        },
        {
          "name": "de farine",
          "quantity": "150g"
        },
        {
          "name": "de levure",
          "quantity": "1 cc"
        },
        {
          "name": "(jus et zeste)",
          "quantity": "2 citrons"
        },
        {
          "name": "de sucre glace",
          "quantity": "130g"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "30-40 min",
      "steps": [
        "Préchauffez le four à 170°C.",
        "Faire fondre le beurre au bain marie.",
        "Versez le sucre dans un saladier avec le beurre fondu et le zeste du citron. Mélangez au fouet jusqu'à ce que le mélange blanchisse.",
        "Ajoutez les oeufs, la farine, la levure, le jus de citron.",
        "Versez la pâte dans un moule à cake légèrement beurré, et mettre au four pendant 30 à 40 min.",
        "Le gâteau doit être légèrement doré, pas trop gonflé.",
        "Démoulez à l'envers, sur une grille. Emballez-le immédiatement dans du film alimentaire pour qu'il garde toute son humidité.",
        "Laissez le cake refroidir dans son emballage.",
        "Quand il est à température ambiante, préparez le glaçage en mélangeant le jus de citron avec le sucre glaçe. Déballez le cake puis versez le glaçage en posant le cake sur une grille. Avec un couteau ou une spatule, lissez le glaçage pour qu'il tombe de tous les côtés et surtout qu'il soit fin.",
        "Remettre le cake au four à 100°C pendant 8 min pour sécher le glaçage."
      ]
    },
    {
      "id": "cheesecake",
      "name": "Cheesecake Vanille Et Caramel Beurre Salé (Sans Cuisson)",
      "image": "/assets/sugar-recipe/cheesecake-caramel-beurre-sale.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "8",
      "ingredients": [
        {
          "name": "de palets bretons",
          "quantity": "250g"
        },
        {
          "name": "de beurre",
          "quantity": "50g"
        },
        {
          "name": "de sucre en poudre",
          "quantity": "160g"
        },
        {
          "name": "de crème liquide",
          "quantity": "60cl (20cl pour le caramel et 40cl pour le cheesecake)"
        },
        {
          "name": "de beurre",
          "quantity": "60g"
        },
        {
          "name": "Fleur de sel",
          "quantity": null
        },
        {
          "name": "de Philadelphia",
          "quantity": "400g"
        },
        {
          "name": "feuilles de gélatine",
          "quantity": "3"
        },
        {
          "name": "de sucre glace",
          "quantity": "4 cs"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "Repos: 6 h",
      "steps": [
        "Pour le fond: Mixer les palets bretons et rajouter le beurre fondu. Bien mélanger et foncer un cercle de 20 cm posé dans un plat avec une feuille de papier cuisson. Bien tasser et réserver au frais.",
        "Pour le caramel beurre salé: Faire chauffer le sucre dans une casserole sans le toucher jusqu'à ce qu'il caramélise. Faire chauffer (dans une autre casserole) la crème liquide et la verser (hors du feu) sur le caramel. Remettre à chauffer tout en mélangeant vigoureusement avec une cuillère en bois. Ajouter le beurre et la fleur de sel (à votre convenance) Laisser refroidir.",
        "Pour le cheesecake: Mettre la gélatine à réhydrater dans de l'eau froide. Récupérer 3 ou 4 cs de crème liquide, la faire chauffer et y dissoudre (hors du feu) la gélatine essorée. Monter la crème liquide en chantilly et serrer en lui ajoutant le sucre glace. Dans un saladier, détendre le philadelphia à la fourchette, ajouter le caramel beurre salé (en garder un peu pour la décoration), puis rajouter la chantilly. Bien mélanger. Recouvrir la base de palets breton avec les 3/4 de la préparation. Mettre le reste dans une poche à douille et décorer le dessus. Faire de même avec le caramel mis de côté.",
        "Mettre au minimum 4 h au frais ou toute une nuit."
      ]
    },
    {
      "id": "fondant_chocolat_blanc",
      "name": "Fondant au chocolat blanc et à la framboise",
      "image": "/assets/sugar-recipe/fondant-chocolat-blanc-framboises.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "12",
      "ingredients": [
        {
          "name": "de chocolat blanc",
          "quantity": "300g"
        },
        {
          "name": "de beurre",
          "quantity": "100g"
        },
        {
          "name": "oeufs",
          "quantity": "3"
        },
        {
          "name": "de sucre en poudre",
          "quantity": "100g"
        },
        {
          "name": "de farine",
          "quantity": "150g"
        },
        {
          "name": "de levure",
          "quantity": "1 cac"
        },
        {
          "name": "de framboises",
          "quantity": "200g"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "20 min",
      "steps": [
        "Préchauffez le four à 180°C.",
        "Faire fondre 200g de chocolat avec le beurre dans une casserole à feu doux.",
        "Versez dans un saladier et laissez refroidir.",
        "Rajoutez le sucre, les oeufs, la farine, la levure, le reste du chocolat concassé et les framboises.",
        "Versez dans un moule et mettre au four pendant 20 min.",
        "Laissez refroidir pour le démouler, car le coeur du gâteau est très fondant.",
        "Servir à température ambiante."
      ]
    },
    {
      "id": "galette_des_rois",
      "name": "Galette des rois à la frangipane",
      "image": "/assets/sugar-recipe/galette-des-rois.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "8",
      "prepTime": "30 min",
      "cookTime": "25 min",
      "sections": [
        {
          "name": "Crème pâtissière",
          "ingredients": [
            {
              "name": "jaunes d'oeufs",
              "quantity": "2"
            },
            {
              "name": "de sucre",
              "quantity": "35g"
            },
            {
              "name": "de farine",
              "quantity": "20g"
            },
            {
              "name": "de lait",
              "quantity": "25cl"
            },
            {
              "name": "de sucre vanillé",
              "quantity": "1 sachet"
            }
          ],
          "steps": [
            "Battre dans un saladier les 2 jaunes d'œufs avec 35 g de sucre.",
            "Ajouter la farine, mélanger, puis ajouter le lait bouillant progressivement tout en mélangeant.",
            "Verser le mélange dans la casserole et fouetter sans s’arrêter pendant 3 min après la reprise de l’ébullition.",
            "Quand le mélange épaissit sans attacher, la crème pâtissière est prête.",
            "Verser la crème pâtissière dans un plat, et recouvrir au contact de film alimentaire (pour éviter la formation d’une croûte).",
            "Réserver la crème pour qu’elle refroidisse pendant 1h minimum."
          ]
        },
        {
          "name": "Crème d'amande",
          "ingredients": [
            {
              "name": "jaunes d'oeufs",
              "quantity": "3"
            },
            {
              "name": "de poudre d'amande",
              "quantity": "125g"
            },
            {
              "name": "de sucre en poudre",
              "quantity": "100g"
            },
            {
              "name": "de beurre pommade",
              "quantity": "125g"
            },
            {
              "name": "de pépites de chocolat",
              "quantity": "50g"
            }
          ],
          "steps": [
            "Travailler ensemble au fouet le beurre pommade et le sucre jusqu’à obtention d’une pâte blanche homogène.",
            "Ajouter les jaunes d’œufs un par un, la poudre d’amande, et enfin les pépites de chocolat. Bien mélanger."
          ]
        },
        {
          "name": "Montage et cuisson",
          "ingredients": [
            {
              "name": "disques de pâte feuilletée",
              "quantity": "2"
            },
            {
              "name": "jaune d'oeuf",
              "quantity": "1"
            }
          ],
          "steps": [
            "Préchauffer le four à 200°C.",
            "Étaler un premier disque de pâte feuilletée.",
            "À l’aide d’un pinceau, recouvrir la bordure de mélange jaune d’œuf / lait sur 2 cm environ.",
            "Ajouter la Frangipane, idéalement en utilisant une poche à douille: Faire une spirale en partant du centre. Ne pas aller trop vers les bords. Ajouter une fève.",
            "Déposer délicatement le 2ème disque de feuilletage. Souder les bords en appuyant délicatement sur tout le tour, en chassant l’air vers l’extérieur.",
            "« Chiqueter » les bords avec un petit couteau, c’est-à-dire faire des petites entailles sur tout le pourtour de la galette.",
            "Avec le dos du couteau, décorer le dessus de la galette d’une jolie rosace, en partant du centre. Faire une entaille au milieu de cette rosace, pour permettre à l’air de s’échapper et au feuilletage de ne pas trop se développer.",
            "Dorer la galette à l’aide d’un pinceau et du mélange jaune d’œuf / lait.",
            "Enfourner pour 10 min à 200°C, puis baisser la température à 180°C et cuire 30 min supplémentaires."
          ]
        }
      ]
    },

    {
      "id": "gateau_vanille_abricots",
      "name": "Gâteau vanillé aux abricots",
      "image": "/assets/sugar-recipe/gateau-aux-abricots-et-a-la-vanille.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de farine",
          "quantity": "3 CS"
        },
        {
          "name": "de sucre",
          "quantity": "4 cc"
        },
        {
          "name": "abricots secs",
          "quantity": "12"
        },
        {
          "name": "oeufs",
          "quantity": "3"
        },
        {
          "name": "levure",
          "quantity": "5g"
        },
        {
          "name": "yaourt nature",
          "quantity": "1 pot"
        },
        {
          "name": "de lait 1/2 écrémé",
          "quantity": "50 ml"
        },
        {
          "name": "de sucre vanillé",
          "quantity": "1 sachet"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "25 min",
      "steps": [
        "Préchauffez le four à 180°C.",
        "Mettez les abricots dans une casserole d'eau froide, portez à ébullition. Quand l'eau bout, retirez du feu, couvrez et laissez gonfler 15 min.",
        "Beurrez un moule. Tamisez la farine et la levure.",
        "Dans un récipient, fouettez les oeufs avec le sucre et le sucre vanillé. Incorporez la farine tamisée, délayez avec le lait et le yaourt.",
        "Versez la préparation dans le moule.",
        "Egouttez les abricots, les répartir sur le dessus de la préparation en les enfonçant légèrement.",
        "Enfournez pendant 25 min.",
        "Soupoudrez de sucre vanillé 5 min avant la fin de la cuisson."
      ]
    },
    {
      "id": "gateau_ananas_noix_coco",
      "name": "Gâteau à l'ananas et à la noix de coco",
      "image": "/assets/sugar-recipe/gateau-a-l-ananas-et-noix-de-coco.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "8",
      "ingredients": [
        {
          "name": "de farine",
          "quantity": "80g"
        },
        {
          "name": "de sucre",
          "quantity": "30g"
        },
        {
          "name": "de crème épaisse à 4%",
          "quantity": "100g"
        },
        {
          "name": "oeufs",
          "quantity": "3"
        },
        {
          "name": "de levure",
          "quantity": "1 sachet"
        },
        {
          "name": "de noix de coco râpée",
          "quantity": "25g (20g pour la préparation et 5g pour la présentation)"
        },
        {
          "name": "d'ananas frais",
          "quantity": "600g"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "30 min",
      "steps": [
        "Préchauffez le four à 180°C.",
        "Coupez 4 à 5 belles tranches d'ananas. Coupez le reste de votre ananas en petits dés et réservez. Conservez le jus de votre ananas.",
        "Disposez vos tranches d'ananas au fond de votre moule.",
        "Dans un récipient, mélangez les ingrédients en les incorporant un à un et en les mélangeant au fur et à mesure : farine, levure, sucre, crème fraîche et les œufs.",
        "Fouettez bien la préparation.",
        "Ajoutez 20g de noix de coco râpée, puis mélangez de nouveau.",
        "Ajoutez les dés d'ananas à la préparation et mélangez de nouveau. Versez la pâte ainsi obtenue sur les rondelles d'ananas déjà disposées dans le moule.",
        "Enfournez pendant 45 min."
      ]
    },
    {
      "id": "tarte_chocolat_noir",
      "name": "Tarte au chocolat noir",
      "image": "/assets/sugar-recipe/tarte-au-chocolat.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "10",
      "ingredients": [
        {
          "name": "de chocolat noir",
          "quantity": "200g"
        },
        {
          "name": "de pâte sablée",
          "quantity": "1 rouleau"
        },
        {
          "name": "de crème liquide",
          "quantity": "20cl"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "20 min",
      "steps": [
        "Préchauffez votre four à 200°C. Faites cuire la pâte à blanc selon le mode d'emploi.",
        "Dans une casserole, faites chauffer la crème liquide.",
        "Dans un saladier, cassez le chocolat en morceaux, versez la crème liquide et couvrez avec une assiette. Attendez 3 à 5 min.",
        "Mélangez à l'aide d'un fouet.",
        "Versez la ganache sur le fond de tarte et placez votre tarte au chocolat au réfrigérateur pendant au moins 2 h."
      ]
    },
    {
      "id": "tarte_citron_meringuee",
      "name": "Tarte au citron meringuée",
      "image": "/assets/sugar-recipe/tarte-citron-meringu.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "pâte brisée",
          "quantity": "1"
        },
        {
          "name": "de maïzena",
          "quantity": "4 CS"
        },
        {
          "name": "oeufs",
          "quantity": "3"
        },
        {
          "name": "citrons non traités (recueillir le jus ainsi que le zeste râpé)",
          "quantity": "3"
        },
        {
          "name": "de sucre",
          "quantity": "150g"
        },
        {
          "name": "de sel",
          "quantity": "1 pincée"
        }
      ],
      "prepTime": "20 min",
      "cookTime": "40 min",
      "steps": [
        "Préchauffez le four à 180°C.",
        "Garnissez un moule à tarte avec la pâte. Piquez le fond avec une fourchette. Cuire la pâte à blanc pendant 10 min.",
        "Délayez la maïzena dans le jus de citron. Incorporez les zestes et 30 cl d'eau froide. Faites épaissir sur feu doux.",
        "Ajoutez 50g de sucre en remuant jusqu'à dissolution. Retirez du feu, laissez tiédir.",
        "Incorporez les jaunes d'œufs en fouettant.",
        "Versez la préparation sur la pâte. Enfournez pendant 20 min. Puis retirez la tarte du four en le laissant allumé et en le mettant sur le mode grill.",
        "Pendant ce temps, montez les blancs en neige avec une pincée de sel, en ajoutant petit à petit le reste de sucre.",
        "Répartissez cette meringue sur la tarte.",
        "Enfournez quelques instants en surveillant bien la prise de la meringue.",
        "Se déguste bien frais."
      ]
    },

    {
      "id": "pates_carbonara",
      "name": "Pâtes à la carbonara",
      "image": "/assets/salty-recipe/pates-carbo.jpg",
      "eventCategory": null,
      "category": ["plat", "rapide"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "Spaghettoni",
          "quantity": "400g"
        },
        {
          "name": "Guanciale (joue de porc) ou pancetta",
          "quantity": "200g"
        },
        {
          "name": "Jaunes d'œufs",
          "quantity": "3"
        },
        {
          "name": "Parmesan",
          "quantity": "100g"
        },
        {
          "name": "Poivre",
          "quantity": "1 cac"
        }
      ],
      "prepTime": "5 min",
      "cookTime": "15 min",
      "steps": [
        "Faire bouillir dans une casserole un grand volume d'eau.",
        "Plonger les pâtes dans l'eau et faire cuire 9-10 min selon le type de pâtes.",
        "Pendant ce temps, couper le guanciale (joue de porc) ou la pancetta en gros lardons d'1cm de côté. Cuire la viande dans une poêle, sans ajout de matière grasse.",
        "Dès que les pâtes sont cuites, les égoutter en gardant un peu d'eau de cuisson dans un bol. Verser les pâtes dans la poêle avec le guanciale ou la pancetta (feu éteint). Bien mélanger. Ensuite, verser la préparation dans un plat.",
        "Dans un bol, mélanger les 3 jaunes d'œufs en ajoutant petit à petit un peu d'eau de cuisson des pâtes jusqu'à obtenir une sauce crémeuse.",
        "Bien mélanger le tout et surtout bien poivrer. C'est le poivre qui donnera du goût au plat.",
        "Ajouter le parmesan.",
        "À déguster tout de suite. Bon appétit!"
      ]
    },
    {
      "id": "spaghetti_bolognaise",
      "name": "Spaghettis à la bolognaise",
      "image": "/assets/salty-recipe/spaghetti-bolognaise.jpg",
      "eventCategory": null,
      "category": ["plat", "rapide"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de spaghettis",
          "quantity": "400g"
        },
        {
          "name": "de boeuf hâché",
          "quantity": "300g"
        },
        {
          "name": "de tomates pelées",
          "quantity": "800g"
        },
        {
          "name": "de coulis de tomate",
          "quantity": "200g"
        },
        {
          "name": "de parmesan ou emmental râpé",
          "quantity": "100g"
        },
        {
          "name": "Oignon",
          "quantity": "1 petit"
        },
        {
          "name": "d'huile d'olive (ou tournesol)",
          "quantity": "1 cuillère à soupe"
        },
        {
          "name": "de sucre en poudre",
          "quantity": "1 cc"
        },
        {
          "name": "de sel",
          "quantity": "1 pincée"
        },
        {
          "name": "de poivre",
          "quantity": "1 pincée"
        }
      ],
      "prepTime": "5 min",
      "cookTime": "15 min",
      "steps": [
        "Épluchez et émincez les oignons en petits cubes.",
        "Chauffez une poêle, ajoutez un filet d'huile, puis ajoutez les oignons en les faisant revenir à feu vif jusqu'à ce qu'ils colorent légèrement.",
        "Ajoutez la viande hachée, salez et poivrez et faites-la cuire à feu vif pendant environ 5 min.",
        "Versez ensuite les tomates pelées, le sucre en poudre et laissez mijoter le tout à feu doux pendant environ 10 min tout en remuant la préparation.",
        "Pendant ce temps, plongez les pâtes dans l'eau et faites-les cuire 9-10 min selon le temps indiqué sur le paquet.",
        "Quand les spaghettis sont cuits, égouttez-les et disposez-les dans des assiettes creuses sans attendre.",
        "Versez la sauce bolognaise sur les spaghettis et saupoudrez de parmesan râpé."
      ]
    },
    {
      "id": "mini_buches_saumon",
      "name": "Mini bûches au saumon",
      "image": "/assets/salty-recipe/mini-buche-saumon.jpg",
      "eventCategory": "plat de fête",
      "category": ["entrée", "aperitif"],
      "servingSize": "2",
      "ingredients": [
        {
          "name": "Tranches de pain de mie",
          "quantity": "4"
        },
        {
          "name": "Kiri",
          "quantity": "2"
        },
        {
          "name": "Tranches de saumon fumé",
          "quantity": "2"
        },
        {
          "name": "Graines de sésame",
          "quantity": "1 cuillère à soupe"
        }
      ],
      "prepTime": "15 min",
      "restingTime": "20 min",
      "steps": [
        "Étalez finement les tranches de pain de mie au rouleau à pâtisserie.",
        "Tartinez ensuite chaque tranche de kiri. Bien en étaler sur les bords du pain de mie car le kiri servira à sceller la bûche.",
        "Disposez sur chaque tranche de pain de mie une tranche de saumon fumé.",
        "Roulez chaque tranche de pain de mie sur elle-même en serrant bien, de façon à former des petites bûches.",
        "Serrez-les dans du film alimentaire et placez-les au réfrigérateur environ 20 min.",
        "Ensuite, sortez les mini bûches du réfrigérateur, enlevez le film, puis coupez chaque bûche en 3 parties égales.",
        "Ajoutez un peu de kiri sur le dessus, puis une pincée de graines de sésame.",
        "Cette recette peut être préparée à l'avance."
      ]
    },
    {
      "id": "terrine_stjacques_saumon",
      "name": "Terrine de Saint Jacques et saumon",
      "image": "/assets/salty-recipe/terrine-st-jacques-saumon.jpg",
      "eventCategory": "plat de fête",
      "category": ["entrée"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "Noix de Saint Jacques",
          "quantity": "8"
        },
        {
          "name": "Tranches de saumon fumé",
          "quantity": "4"
        },
        {
          "name": "Crème fraiche",
          "quantity": "10cl"
        },
        {
          "name": "Échalotte",
          "quantity": "1 petite"
        },
        {
          "name": "Feuilles de gélatine",
          "quantity": "2"
        },
        {
          "name": "Pavés de saumon",
          "quantity": "2"
        },
        {
          "name": "Lait (pour recouvrir les Saint Jacques)",
          "quantity": "20cl"
        },
        {
          "name": "Estragon (surgelé ou en poudre)",
          "quantity": ""
        }
      ],
      "prepTime": "30 min",
      "restingTime": "20 min",
      "steps": [
        "Mettez 48h avant, dans du lait, vos coquilles St Jacques à décongeler dans un saladier.",
        "La veille :",
        "Faites bouillir de l'eau avec du sel et du poivre, puis éteignez le feu et mettez les saumons pendant 20 min à couvert.",
        "Pendant ce temps, faites chauffer à feu doux les coquilles avec le lait vanillé. 5 min après le début de l'ébullition, égouttez.",
        "Pendant la cuisson des coquilles, mettez les feuilles de gélatine dans un bol avec de l'eau tiède.",
        "Dans un mixeur, mélangez le saumon avec l'échalote préalablement hachée, la crème, le sel, le poivre, l'estragon, les feuilles de gélatine ramollies, et mixez.",
        "Dans une terrine, étirez un film plastique de manière à le faire largement dépasser les bords (phase délicate, le fond doit être lisse car c'est celui qu'on présente).",
        "Ajoutez les tranches de saumon. Par-dessus les tranches, alternez une couche de Saint-Jacques et une couche de préparation de saumon.",
        "Répétez l'opération.",
        "Fermez le dessus avec le film plastique et réservez au frais pendant 24 h."
      ]
    },
    {
      "id": "verrines_avocat_saumon",
      "name": "Verrines avocat et saumon fumé",
      "image": "/assets/salty-recipe/avocat-saumon-fume-en-verrines.jpg",
      "eventCategory": "plat de fête",
      "category": ["entrée"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "Citron",
          "quantity": "1"
        },
        {
          "name": "Crème fraiche épaisse",
          "quantity": "25 cl"
        },
        {
          "name": "Avocats",
          "quantity": "2"
        },
        {
          "name": "Tranches de saumon fumé",
          "quantity": "3"
        },
        {
          "name": "de sel",
          "quantity": "1 pincée"
        },
        {
          "name": "de poivre",
          "quantity": "1 pincée"
        }
      ],
      "prepTime": "15 min",
      "steps": [
        "Prélever la chair des avocats et la réduire en purée. Ajouter le jus d'un demi-citron au mélange afin de le parfumer et d'éviter qu'il noircisse.",
        "Détailler les tranches de saumon fumé en fines lanières et y verser quelques gouttes de citron.",
        "Mettre au fond d'un verre : la purée d'avocat au citron, puis quelques cuillères à café de crème fraîche, et terminer par quelques lanières de saumon fumé en les enroulant sur elles-mêmes. Ajouter une rondelle de citron pour décorer.",
        "Se déguste frais."
      ]
    },
    {
      "id": "papillotes_cabillaud",
      "name": "Papillotes de cabillaud",
      "image": "/assets/salty-recipe/dos-de-cabillaud-en-papillote.jpeg",
      "category": ["plat", "rapide"],
      "eventCategory": "poisson",
      "servingSize": "2",
      "ingredients": [
        {
          "name": "filets de cabillaud",
          "quantity": "2"
        },
        {
          "name": "poivron vert",
          "quantity": "1 demi"
        },
        {
          "name": "poivron rouge",
          "quantity": "1 demi"
        },
        {
          "name": "tomate",
          "quantity": "1"
        },
        {
          "name": "branches de thym",
          "quantity": "2"
        },
        {
          "name": "Curry en poudre"
        },
        {
          "name": "Huile d'olive"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "30 min",
      "difficulty": "Facile",
      "steps": [
        "Lavez, épépinez et coupez en petits dés les poivrons et la tomate.",
        "Disposez 2 feuilles de papier sulfurisé sur le plan de travail, posez au centre de chaque feuille un filet de cabillaud.",
        "Salez, poivrez, ajoutez le curry selon vos goûts, puis répartissez les légumes.",
        "Nappez chaque filet d'une cuillère à café d'huile d'olive, déposez une branche de thym et refermez bien les papillotes en roulant les bords des feuilles de papier pour que ce soit bien hermétique.",
        "Déposez les papillotes dans un plat allant au four et enfournez à 30 min.",
        "Astuce : avec ce mode de cuisson, les poivrons sont encore un peu croquants. Si vous les voulez plutôt fondants, faites-les cuire dans une poêle avant de dresser vos papillotes."
      ]
    },
    {
      "id": "sauce_cabillaud",
      "name": "Sauce pour cabillaud",
      "image": "/assets/salty-recipe/sauce-cabillaud.jpg",
      "category": ["sauce", "rapide"],
      "eventCategory": "poisson",
      "servingSize": "4",
      "ingredients": [
        {
          "name": "filets de cabillaud",
          "quantity": "4"
        },
        {
          "name": "moutarde à l'ancienne",
          "quantity": "20g"
        },
        {
          "name": "échalote",
          "quantity": "1"
        },
        {
          "name": "de beurre",
          "quantity": "10g"
        },
        {
          "name": "de crème liquide",
          "quantity": "20cl"
        },
        {
          "name": "Jus de citron"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "10 min",
      "difficulty": "Facile",
      "steps": [
        "Faites cuire les filets de cabillaud avec un filet d'huile dans une poêle, à feu moyen, quelques min. Retournez à mi-cuisson.",
        "Épluchez et ciselez finement l'échalote.",
        "Dans une casserole, faites fondre le beurre, puis ajoutez l'échalote et la cuire jusqu'à ce qu'elle soit translucide.",
        "Ajoutez ensuite la crème, la moutarde et bien mélanger.",
        "Assaisonnez votre sauce moutarde et laissez épaissir à feu doux pendant environ 10 min.",
        "Ajoutez le jus du 1/2 citron et laissez cuire encore quelques min. Votre sauce est prête : elle se sert bien chaude."
      ]
    },
    {
      "id": "saumon_amandes",
      "name": "Saumon aux amandes",
      "image": "/assets/salty-recipe/saumon-amandes.jpg",
      "category": ["plat", "rapide"],
      "eventCategory": "poisson",
      "servingSize": "4",
      "ingredients": [
        {
          "name": "pavés de saumon frais",
          "quantity": "4"
        },
        {
          "name": "de beurre",
          "quantity": "2 cc"
        },
        {
          "name": "d'amandes effilées",
          "quantity": "20g"
        },
        {
          "name": "de crème semi-épaisse",
          "quantity": "40g"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "15 min",
      "difficulty": "Facile",
      "steps": [
        "Faire cuire doucement les pavés de saumon dans une poêle antiadhésive puis les réserver au chaud. Essuyez la poêle, faire fondre la margarine et faire dorer les amandes effilées quelques instants.",
        "Ajoutez la crème, salez, poivrez. Déposez le poisson, faire réduire 5 min.",
        "Posez le saumon par-dessus, arrosez d'un filet d'huile d'olive, salez et poivrez de nouveau et ajoutez une tranche de citron.",
        "Ce plat peut être accompagné de pâtes."
      ]
    },
    {
      "id": "saumon_cumin",
      "name": "Papillottes de saumon au cumin",
      "image": "/assets/salty-recipe/saumon-papillotte.jpg",
      "category": ["plat", "rapide"],
      "eventCategory": "poisson",
      "servingSize": "2",
      "ingredients": [
        {
          "name": "portions de saumon",
          "quantity": "2"
        },
        {
          "name": "carotte",
          "quantity": "1"
        },
        {
          "name": "courgette",
          "quantity": "1"
        },
        {
          "name": "Cumin en poudre"
        },
        {
          "name": "Herbes de Provence"
        },
        {
          "name": "Jus de citron"
        },
        {
          "name": "Huile d'olive"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "30 min",
      "difficulty": "Facile",
      "steps": [
        "Préchauffez le four à 180°C.",
        "Coupez la carotte et la courgette en fins bâtonnets, puis les répartir sur 2 feuilles de papier sulfurisé. Parsemez de cumin, herbes de Provence, sel, poivre.",
        "Posez le saumon par-dessus, arrosez d'un filet d'huile d'olive, salez et poivrez de nouveau et ajoutez une tranche de citron.",
        "Fermez la papillote de façon hermétique et cuire 25-30 min."
      ]
    },
    {
      "id": "coquilles_saint_jacques",
      "name": "Coquilles Saint Jacques",
      "image": "/assets/salty-recipe/st-jacques.jpg",
      "category": ["entrée"],
      "eventCategory": "poisson",
      "servingSize": "6",
      "ingredients": [
        {
          "name": "noix de Saint Jacques",
          "quantity": "12"
        },
        {
          "name": "de champignons de Paris",
          "quantity": "300g"
        },
        {
          "name": "échalote",
          "quantity": "1"
        },
        {
          "name": "de farine",
          "quantity": "40g"
        },
        {
          "name": "de beurre",
          "quantity": "60g"
        },
        {
          "name": "de gruyère râpé",
          "quantity": "40g"
        },
        {
          "name": "de vin blanc",
          "quantity": "10cl"
        },
        {
          "name": "de lait",
          "quantity": "50cl"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "30 min",
      "difficulty": "Facile",
      "steps": [
        "Epluchez et hachez les échalotes. Nettoyez et hachez les champignons.",
        "Faites chauffer 10g de beurre dans une poêle et faites-y revenir les échalotes 3 min environ. Ajoutez les champignons, un peu de sel et de poivre et faites-les rissoler 3 min en remuant. Versez le vin et laissez réduire aux 2/3. Sortez du feu.",
        "Dans une casserole, faites chauffer 40g de beurre. Une fois qu'il mousse, ajoutez la farine et fouettez jusqu'à obtenir une béchamel onctueuse. Salez, poivrez et ajoutez le gruyère en mélangeant. Réservez hors du feu.",
        "Préchauffez le four à 200°C. Faites chauffer les 10g de beurre restant dans une poêle. Faites-y dorer les Saint-Jacques 20 secondes sur chaque face jusqu'à ce qu'elles prennent une belle couleur dorée. Mélangez les Saint Jacques à la béchamel et aux champignons.",
        "Répartissez la préparation dans les coquilles vides. Saupoudrez de chapelure et enfournez 10 min pour que le dessus soit bien gratiné. Servez bien chaud.",
        "Astuce : Pour le décor et pour apporter un peu de croustillant, vous pouvez utiliser de la pâte feuilletée dans laquelle vous découperez une forme à l'emporte-pièce. Dorez au jaune d'œuf et cuisez 10 min à 180°C. Placez-les sur les coquilles Saint Jacques au moment de servir."
      ]
    },
    {
      "id": "gratin_dauphinois",
      "name": "Gratin dauphinois",
      "image": "/assets/salty-recipe/gratin_dauphinois.jpg",
      "category": ["plat"],
      "eventCategory": "winter",
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de pommes de terre",
          "quantity": "1kg"
        },
        {
          "name": "gousse d'ail",
          "quantity": "1"
        },
        {
          "name": "de lait",
          "quantity": "80 cl"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "20 min",
      "cookTime": "50 min",
      "difficulty": "Facile",
      "steps": [
        "Pelez les pommes de terre. Lavez-les. Coupez-les en lamelles régulières de 2 à 3 mm d'épaisseur.",
        "Beurrez un plat allant au four.",
        "Pelez une gousse d'ail, coupez-la en 2 pour enlever le germe. Frottez le plat avec la gousse d'ail. Puis écrasez-la avec la lame large du couteau.",
        "Préchauffez le four à 150°C.",
        "Dans une casserole, versez 80cl de lait, ajoutez les rondelles de pommes de terre, l'ail écrasé, du sel et du poivre.",
        "Portez à ébullition. Retirez du feu. Avec un écumoire, répartissez les pommes de terre dans le plat en les faisant se chevaucher. Versez le lait. Parsemez de 30g de beurre en morceaux et enfournez pendant environ 50 min. Piquez les pommes de terre avec la pointe d'un couteau pour vérifier qu'elles soient cuites."
      ]
    },
    {
      "id": "pommes_de_terre_raclette",
      "name": "Pommes de terre raclette et lard fumé",
      "image": "/assets/salty-recipe/Pommes-de-terre-au-fromage-a-raclette-et-lard-fume.jpg",
      "category": ["plat"],
      "eventCategory": "winter",
      "servingSize": "4",
      "ingredients": [
        {
          "name": "pommes de terre",
          "quantity": "8"
        },
        {
          "name": "de fromage à raclette",
          "quantity": "8 tranches"
        },
        {
          "name": "de lard fumé",
          "quantity": "4 tranches"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "20 min",
      "cookTime": "20 min",
      "difficulty": "Facile",
      "steps": [
        "Faites cuire les pommes de terre lavées et non épluchées à l'eau avec une pincée de sel.",
        "Égouttez-les, passez-les sous l'eau froide, épluchez-les en deux dans le sens de la longueur.",
        "Dans un plat allant au four, assemblez les tranches de pommes de terre, de lard et de raclette (comme sur la photo) et piquez un bâtonnet pour maintenir en place. Vous pouvez remplacer le lard par des tranches de chorizo ou du jambon.",
        "Passez au four à 180°C ou sous le grill jusqu'à ce que le fromage fonde. Servez aussitôt."
      ]
    },
    {
      "id": "veloute_de_butternut",
      "name": "Velouté de butternut",
      "image": "/assets/salty-recipe/veloute-de-butternut.jpg",
      "category": ["entrée"],
      "eventCategory": "winter",
      "servingSize": "4",
      "ingredients": [
        {
          "name": "butternut",
          "quantity": "1"
        },
        {
          "name": "oignon",
          "quantity": "1"
        },
        {
          "name": "bouillon de cube à la volaille",
          "quantity": "1"
        },
        {
          "name": "de crème liquide",
          "quantity": "100ml"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "20 min",
      "cookTime": "20 min",
      "difficulty": "Facile",
      "steps": [
        "Évidez la courge, pelez-la et coupez-la en morceaux.",
        "Dans une grande casserole, faites fondre du beurre. Faites-y revenir l'oignon émincé, et ajoutez les cubes de butternut.",
        "Faites revenir le tout pendant environ 5 min, puis couvrez d'eau. Ajoutez le cube de bouillon, salez, poivrez, et portez à ébullition.",
        "Une fois que le mélange bout, couvrez et laissez cuire 25 min à feu moyen.",
        "Mettez le tout dans le blender, et ajoutez la crème liquide que vous aurez préalablement fait chauffer. Mixez finement. Vous pouvez remplacer la crème par du lait.",
        "Et voilà, votre velouté de courge butternut est prêt !"
      ]
    },
    {
      "id": "veloute_de_lentilles_corail",
      "name": "Velouté de lentilles corail",
      "image": "/assets/salty-recipe/veloute-lentilles-corail.jpg",
      "category": ["entrée", "rapide"],
      "eventCategory": "winter",
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de lentilles corail",
          "quantity": "250g"
        },
        {
          "name": "de curry en poudre",
          "quantity": "2 cc"
        },
        {
          "name": "bouillon de cube à la volaille",
          "quantity": "1"
        }
      ],
      "prepTime": "5 min",
      "cookTime": "20 min",
      "difficulty": "Facile",
      "steps": [
        "Chauffez de l'eau dans une grande casserole.",
        "Versez les lentilles corail, le bouillon de cube émietté et le curry dans la casserole.",
        "Laissez cuire environ 20 min à couvert.",
        "Une fois la préparation refroidie, mixez les lentilles. Si le velouté est trop épais, diluez-le avec de l'eau jusqu'à obtenir la consistance désirée.",
        "Réchauffez le velouté juste avant de le déguster. Servez bien chaud."
      ]
    },
    {
      "id": "curry_de_dinde_a_la_creme",
      "name": "Curry de dinde à la crème et aux champignons",
      "image": "/assets/salty-recipe/dinde-au-curry.jpg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "2",
      "ingredients": [
        {
          "name": "escalopes de dinde",
          "quantity": "2"
        },
        {
          "name": "oignon",
          "quantity": "1"
        },
        {
          "name": "de curry",
          "quantity": "1 cc"
        },
        {
          "name": "de crème fraiche semi épaisse",
          "quantity": "100g"
        },
        {
          "name": "de champignons de Paris émincés (230g égouttés)",
          "quantity": "1 boite"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "20 min",
      "difficulty": "Facile",
      "steps": [
        "Epluchez l'oignon et hachez-le. Coupez les escalopes de dinde en dés. Egouttez les champignons.",
        "Dans une poêle antiadhésive, faites revenir les oignons, puis la viande, sur feu vif, environ 10 min en mélangeant régulièrement.",
        "Ajoutez le curry, mélangez, puis ajoutez la crème et les champignons. Poursuivez la cuisson 5 min. Salez et poivrez.",
        "Servez chaud accompagné de riz, par exemple."
      ]
    },
    {
      "id": "escalopes_de_poulet_a_la_moutarde",
      "name": "Escalopes de poulet à la moutarde",
      "image": "/assets/salty-recipe/poulet-sauce-moutarde.jpg",
      "category": ["plat", "rapide"],
      "eventCategory": null,
      "servingSize": "2",
      "ingredients": [
        {
          "name": "aiguillettes de poulet",
          "quantity": "2"
        },
        {
          "name": "d'eau",
          "quantity": "250ml"
        },
        {
          "name": "de moutarde",
          "quantity": "1 CS"
        },
        {
          "name": "carotte",
          "quantity": "1"
        },
        {
          "name": "de crème fraiche",
          "quantity": "2 CS"
        },
        {
          "name": "Huile d'olive"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "20 min",
      "difficulty": "Facile",
      "steps": [
        "Faites revenir dans une poêle, avec l'huile d'olive, les aiguillettes de poulet.",
        "Préparez les tagliatelles de carottes : épluchez et rincez la carotte, puis à l'aide d'un économe, réalisez des tagliatelles. Les faire revenir quelques min dans l'huile d'olive. Salez et poivrez.",
        "Diluez dans 1/2 verre d'eau chaude la moutarde et versez le tout dans la poêle. Laissez chauffer environ 10 min, puis ajoutez la crème. Salez et poivrez.",
        "Ajoutez les tagliatelles de carottes. Servez immédiatement."
      ]
    },
    {
      "id": "lasagnes_a_la_bolognaise",
      "name": "Lasagnes à la bolognaise",
      "image": "/assets/salty-recipe/lasagnes-a-la-bolognaise.jpg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "4",
      "ingredients": [
        {
          "name": "plaques à lasagnes",
          "quantity": "12"
        },
        {
          "name": "de boeuf haché",
          "quantity": "300g"
        },
        {
          "name": "de coulis de tomates",
          "quantity": "2 briques"
        },
        {
          "name": "d'emmental râpé",
          "quantity": "100g"
        },
        {
          "name": "de lait",
          "quantity": "50cl"
        },
        {
          "name": "de farine",
          "quantity": "70g"
        },
        {
          "name": "d'huile de tournesol",
          "quantity": "1 CS"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "20 min",
      "cookTime": "40 min",
      "difficulty": "Facile",
      "steps": [
        "Verser l'huile dans une poêle chaude. Y ajouter la viande hâchée.",
        "Une fois la viande cuite, ajouter le coulis de tomates, le sel et le poivre. Laisser mijoter.",
        "Pendant ce temps, préparer la béchamel : Verser le lait dans une casserole. Ajouter la farine. Bien mélanger au fouet jusqu'à ce que la béchamel épaississe. Saler et poivrer.",
        "Beurrer un plat rectangulaire, y déposer une couche de béchamel, puis une couche de lasagnes, et une couche de sauce tomate à la viande parsemée d'emmental râpé. Répéter l'opération jusqu'à épuisement des ingrédients en terminant par de la béchamel, et saupoudrer avec du gruyère râpé.",
        "Enfourner à four préchauffé à 165°C (thermostat 5/6) pendant environ 45 min, pour que les lasagnes soient bien gratinées. Si les lasagnes gratinent trop vite, les recouvrir de papier d'aluminium."
      ]
    },
    {
      "id": "poulet_basquaise",
      "name": "Poulet basquaise",
      "image": "/assets/salty-recipe/poulet-basquaise.jpg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de poulet",
          "quantity": "6 cuisses ou 12 pilons"
        },
        {
          "name": "de tomates",
          "quantity": "1kg"
        },
        {
          "name": "poivrons (verts et rouges)",
          "quantity": "2"
        },
        {
          "name": "oignons émincés",
          "quantity": "2"
        },
        {
          "name": "gousses d'ail",
          "quantity": "2"
        },
        {
          "name": "de bouillon de volaille",
          "quantity": "200ml"
        },
        {
          "name": "bouquet garni",
          "quantity": "1"
        },
        {
          "name": "d'huile d'olive",
          "quantity": "6 CS"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "20 min",
      "cookTime": "1h 20min",
      "difficulty": "Facile",
      "steps": [
        "Hachez l'ail et l'oignon.",
        "Pelez puis coupez les tomates en morceaux et détaillez les poivrons en lanières.",
        "Faire chauffer 4 cuillères à soupe d'huile dans une cocotte. Y faire dorer les oignons, l'ail et les poivrons. Laissez cuire 5 min.",
        "Ajoutez les tomates et le bouillon dans la cocotte, salez, poivrez.",
        "Couvrez et laissez mijoter 20 min.",
        "Dans une sauteuse, faites dorer les morceaux de poulet dans l'huile. Salez et poivrez.",
        "Lorsqu'ils sont dorés, ajoutez-les aux légumes, ajoutez le bouquet garni. Couvrez. C'est parti pour 45 min de cuisson à feu moyen."
      ]
    },
    {
      "id": "roti_porc_miel_moutarde",
      "name": "Rôti de porc au miel et à la moutarde",
      "image": "/assets/salty-recipe/Rôti-de-porc-à-la-moutarde.jpg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "8",
      "ingredients": [
        {
          "name": "de rôti de porc dans le filet",
          "quantity": "800g"
        },
        {
          "name": "de miel (liquide)",
          "quantity": "3 CS"
        },
        {
          "name": "de moutarde",
          "quantity": "2 CS"
        },
        {
          "name": "de thym",
          "quantity": "2 cc"
        },
        {
          "name": "de crème fraîche",
          "quantity": "2 CS"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "40 min",
      "difficulty": "Facile",
      "steps": [
        "Dans un bol, mélangez le miel, la moutarde et le thym.",
        "Préchauffez le four à 180°C.",
        "Placez le rôti dans un plat allant au four, et badigeonnez-le de la préparation miel/moutarde. Salez et poivrez.",
        "Ajoutez 1/2 verre d'eau.",
        "Enfournez et laissez cuire environ 40 min."
      ]
    },
    {
      "id": "pizza_poulet_curry",
      "name": "Pizza au poulet curry",
      "image": "/assets/salty-recipe/pizza poulet.jpeg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "4",
      "prepTime": "20 min",
      "cookTime": "30 min",
      "sections": [
        {
          "name": "Pâte à pizza",
          "ingredients": [
            {
              "name": "de sel",
              "quantity": "12g"
            },
            {
              "name": "d'huile d'olive",
              "quantity": "12g"
            },
            {
              "name": "de farine",
              "quantity": "300g"
            },
            {
              "name": "d'eau",
              "quantity": "200ml"
            },
            {
              "name": "de levure fraîche de boulanger",
              "quantity": "14g"
            }
          ],
          "steps": [
            "Mettre la farine dans le saladier, ajouter l'huile d'olive, le sel et l'eau. Commencer à pétrir puis ajouter la levure de boulanger (Attention : le sel et la levure ne doivent pas être en contact car sinon la pâte ne lèvera pas).",
            "Pétrir pendant 5 min. Puis laisser poser la pâte 10 min.",
            "Ensuite, pétrir la pâte une seconde fois, laisser poser 10 min, puis pétrir une troisième fois. Cette procédure donnera force et élasticité à la pâte.",
            "Laisser reposer la pâte au réfrigérateur dans une boîte hermétique pendant au moins 24 h.",
            "Après ce temps de repos, sortez la pâte et laissez-la poser à température ambiante pendant quelques h. Une fois que la pâte a doublé de volume, étalez-la au rouleau sur un plan de travail fariné puis déposez-la sur la plaque de cuisson."
          ]
        },
        {
          "name": "Garniture",
          "ingredients": [
            {
              "name": "escalope de poulet",
              "quantity": "1"
            },
            {
              "name": "de crème semi-épaisse",
              "quantity": "20cl"
            },
            {
              "name": "Curry en poudre"
            },
            {
              "name": "de gruyère râpé",
              "quantity": "50g"
            },
            {
              "name": "de lardons fumés",
              "quantity": "100g"
            }
          ],

          "steps": [
            "Découpez l'escalope de poulet en cubes et faites revenir les morceaux de poulet dans une poêle huilée.",
            "Ajoutez le curry, mélangez, puis ajoutez la crème. Gardez un peu de crème pour la pâte.",
            "Préchauffez le four à 230°C.",
            "Étalez le reste de crème sur la pâte à l'aide d'un pinceau ou avec le dos d'une cuillère. Ajoutez la garniture au poulet, les lardons, puis parsemez de gruyère râpé ou de mozzarella.",
            "Mettez la pizza au four pendant 15 min, puis baissez la température à 180°C pour le reste de la cuisson pendant environ 20 min.",
            "À la sortie du four, laissez la pizza au poulet curry reposer pendant quelques min avant de la découper et de la déguster.",
            "Savourez votre délicieuse pizza au poulet curry bien chaude !"
          ]
        }
      ]
    },
    {
      "id": "glace_au_chocolat",
      "image": "/assets/current-recipe/glace-au-chocolat.jpg",
      "name": "Glace au chocolat sans sorbetière",
      "eventCategory": "summer",
      "servingSize": "4",
      "prepTime": "30 min",
      "cookTime": "0 min",
      "ingredients": [
        {
          "name": "de chocolat noir (pâtissier)",
          "quantity": "150 g"
        },
        {
          "name": "de crème entière",
          "quantity": "25 cl"
        },
        {
          "name": "de sucre",
          "quantity": "90 g"
        },
        {
          "name": "oeufs",
          "quantity": "2"
        },
        {
          "name": "jaune d'oeuf",
          "quantity": "1"
        }
      ],
      "steps": [
        "Mettre la crème dans un récipient pour la monter en chantilly plus tard, et mettre le tout dans le réfrigérateur, avec les fouets du batteur électrique, pendant au moins 20 min. Cela permettra à la crème de monter plus facilement.",
        "Pendant ce temps, faire fondre le chocolat au bain-marie. Laisser refroidir hors du feu",
        "Battre les jaunes d'œufs et le sucre quelques minutes.",
        "Ajouter le chocolat fondu à la préparation et mélanger",
        "Monter la crème liquide en chantilly puis l’incorporer à la préparation",
        "Battre les 2 blancs d’œufs en neige, puis les ajouter à l'ensemble de la préparation",
        "Ajouter des pépites de chocolat selon vos envies",
        "Placer au congélateur pendant au moins 4 heures, en remuant toutes les 30 minutes pour éviter la formation de cristaux de glace.",
        "Servez et dégustez votre glace au chocolat maison!"
      ]
    },
    {
      "id": "confiture_de_fraise",
      "image": "/assets/current-recipe/confiture-de-fraises.jpg",
      "name": "Confiture de fraises",
      "eventCategory": "summer",
      "servingSize": "4",
      "prepTime": "10 min",
      "cookTime": "45 min",
      "ingredients": [
        {
          "name": "de fraises fraîches",
          "quantity": "1 kg"
        },
        {
          "name": "de sucre cristallisé",
          "quantity": "250 g"
        },
        {
          "name": "de jus de citron",
          "quantity": "2 cuillères à soupe"
        }
      ],
      "steps": [
        "Lavez, équeutez et coupez les fraises en morceaux.",
        "Dans une marmite, mélangez les fraises avec le sucre et le jus de citron.",
        "Faites cuire en maintenant l'ébullition 30 min environ, en remuant de temps en temps.",
        "Faites le test de l'assiette froide : sortir une assiette de réfrigérateur et y mettre quelques gouttes de confiture. Placer l'assiette à la verticale. Si la confiture ne coule pas, cela veut dire qu'elle est cuite.",
        "Versez la confiture dans des pots stérilisés et fermez-les hermétiquement. Les retourner jusqu'à complet refroidissement.",
        "Les pots se conservent ainsi 2-3 ans dans un endroit sec et à l'abri de la lumière."
      ]
    },
    {
      "id": "tarte_aux_fraise",
      "image": "/assets/current-recipe/tarte-aux-fraises.webp",
      "name": "Tarte aux fraises",
      "eventCategory": "summer",
      "servingSize": "8",
      "prepTime": "30 min",
      "cookTime": "25 min",
      "sections": [
        {
          "name": "Pâte sablée",
          "ingredients": [
            {
              "name": "de farine",
              "quantity": "250g"
            },
            {
              "name": "de beurre mou",
              "quantity": "125g"
            },
            {
              "name": "oeuf",
              "quantity": "1"
            },
            {
              "name": "de sucre glace",
              "quantity": "60g"
            }
          ],
          "steps": [
            "Incorporez le beurre coupé en dés à la farine en mélangeant avec les doigts de façon à obtenir un sable grossier. Attention à ne pas trop travailler la pâte sinon elle devient élastique. Il faut juste incorporer les ingrédients.",
            "Ajoutez l'oeuf tout en continuant de mélanger avec les mains. Versez progressivement le sucre glace et pétrissez jusuq'à obtenir une pâte homogène.",
            "Formez une boule, enveloppez-la dans du film alimentaire et laissez reposer au réfrigérateur pendant environ 2 heures."
          ]
        },
        {
          "name": "Crème pâtissière",
          "ingredients": [
            {
              "name": "de lait",
              "quantity": "500 ml"
            },
            {
              "name": "jaunes d'oeufs",
              "quantity": "3"
            },

            {
              "name": "de sucre en poudre",
              "quantity": "75g"
            },
            {
              "name": "de farine",
              "quantity": "40g"
            }
          ],
          "steps": [
            "Faire chauffer le lait.",
            "Travailler les jaunes d'oeufs avec le sucre jusqu'à ce que le mélange blanchisse et devienne mousseux.",
            "Ajouter la farine en pluie. Bien mélanger. Verser le lait bouillant petit à petit sur le mélange.",
            "Remettre le tout sur feu doux et porter doucement à ébullition 5 minutes, en tournant sans cesse."
          ]
        },
        {
          "name": "Montage et cuisson",
          "ingredients": [
            {
              "name": "disques de pâte feuilletée",
              "quantity": "2"
            },
            {
              "name": "jaune d'oeuf",
              "quantity": "1"
            }
          ],
          "steps": [
            "Préchauffer le four à 180°C.",
            "Étaler la pâte sur un plan fariné. La pâte étant fragile, on peut l'étaler entre 2 feuilles de papier sulfurisé.",
            "Garnir le moule à tarte de la pâte en épousant bien le fond du moule et recouper les bords.",
            "Cuire la pâte à blanc pendant 15 min environ à 180° en mettant dessus un papier sulfurisé avec des noyaux ou des légumes secs (pour éviter les gonflements de la pâte). Avant la fin de la cuisson, retirer le papier pour que le fond cuise aussi. Bien surveiller la cuisson pour que la pâte ne cuise pas trop et reste couleur blond.",
            "Laver les fraises rapidement, les égoutter puis les équeuter.",
            "Quand le fond de tarte est refroidi étaler dessus la crème pâtissière refroidie et déposer par dessus les fraises en rang serré.",
            "Dans une petite casserole, sur feu doux, délayer 2 cuillerées de gelée de fruits (ou de confiture sans les fruits) avec 1 cuillerée d'eau. Faire briller la tarte en passant ce nappage au pinceau sur les fruits."
          ]
        }
      ]
    },
    {
      "id": "gateau_chocolat",
      "image": "/assets/sugar-recipe/gateau-au-chocolat.jpeg",
      "name": "Gâteau au chocolat",
      "eventCategory": null,
      "servingSize": "6",
      "prepTime": "30 min",
      "cookTime": "40 min",
      "sections": [
        {
          "name": "Fondant au chocolat",
          "ingredients": [
            {
              "name": "de chocolat pâtisier",
              "quantity": "240g"
            },
            {
              "name": "de beurre en parcelles",
              "quantity": "200g"
            },
            {
              "name": "de lait",
              "quantity": "150 ml"
            },
            {
              "name": "de farine",
              "quantity": "100g"
            },
            {
              "name": "de sucre en poudre",
              "quantity": "150g"
            },
            {
              "name": "oeufs",
              "quantity": "6"
            },
            {
              "name": "de poudre d'amande",
              "quantity": "125g"
            }
          ],
          "steps": [
            "Préchauffez le four à 160°C (th.5/6). Dans une casserole, faites fondre le chocolat avec le beurre et le lait sur feu très doux.",
            "Hors du feu, incorporez la farine et le sucre en poudre en fouettant.",
            "Fouettez les jaunes d'oeufs avec les amandes en poudre. Incorporez au mélange précédent.",
            "Fouettez les blancs en neige avec une pincée de sel. Incorporez les délicatement à la préparation précédente. Versez dans un moule à manquer beurré.",
            "Enfournez pour 1 heure."
          ]
        },
        {
          "name": "Ganache au chocolat",
          "ingredients": [
            {
              "name": "de chocolat pâtisier",
              "quantity": "100g"
            },
            {
              "name": "de crème fraîche",
              "quantity": "25cl"
            }
          ],
          "steps": [
            "Faire fondre le chocolat au bain-marie.",
            "Ajouter la crème faîche tout en mélangeant.",
            "Napper le gâteau avec une spatule dès que le mélange est homogène.",
            "Astuce: Pour un aspect bien brillant, nappez votre gâteau encore chaud."
          ]
        }
      ]
    },
    {
      "id": "mini_pizza_tortilla",
      "name": "Mini pizza tortilla",
      "image": "/assets/salty-recipe/mini-pizzas.jpg",
      "category": ["entrée"],
      "eventCategory": null,
      "servingSize": "4",
      "ingredients": [
        {
          "name": "tortillas de blé ou mais",
          "quantity": "2"
        },
        {
          "name": "petite brique de coulis de tomates",
          "quantity": "1"
        },
        {
          "name": "de jambon",
          "quantity": "1 tranche"
        },
        {
          "name": "de champignons",
          "quantity": "1 petite boite"
        },
        {
          "name": "Gruyère rapé"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "20 min",
      "cookTime": "15 min",
      "difficulty": "Facile",
      "steps": [
        "Préchauffer le four à 180°C.",
        "Détaillez des petits cercles dans les tortillas à l'aide d'un emporte-pièce (si votre emporte pièce n'est pas assez tranchant, aidez vous d'une paire de ciseaux de cuisine pour les découper.",
        "Disposez les cercles de tortillas sur du papier sulfurisé sur une plaque de cuisson, puis étalez une couche de coulis de tomates à l'aide d'une petite cuillère (on utilisera pas toute la brique).",
        "Découpez le jambon en petits morceaux et le disposer sur les pizzas, parsemez de gruyère râpé, puis terminez en disposant des lamelles de champignon.",
        "Enfourner 10 à 15 minutes "
      ]
    },
    {
      "id": "samossas_poulet",
      "name": "Samossas au poulet et poivron",
      "image": "/assets/salty-recipe/samossas.jpg",
      "category": ["entrée"],
      "eventCategory": null,
      "servingSize": "4",
      "ingredients": [
        {
          "name": "feuilles de brick",
          "quantity": "8"
        },
        {
          "name": " de blanc de poulet",
          "quantity": "250 g"
        },
        {
          "name": "poivron rouge",
          "quantity": "1"
        },
        {
          "name": "oignon",
          "quantity": "1"
        },
        {
          "name": "de paprika en poudre",
          "quantity": "2 cc"
        },
        {
          "name": "de curry en poudre",
          "quantity": "2 cc"
        },
        {
          "name": "de concentré de tomate",
          "quantity": "3 CS"
        },
        {
          "name": "persil ciselé",
          "quantity": "1 CS"
        },
        {
          "name": "Huile d'olive"
        },
        {
          "name": "Sel"
        },
        {
          "name": "Poivre"
        }
      ],
      "prepTime": "1h 20 min",
      "cookTime": "10 min",
      "difficulty": "Moyenne",
      "steps": [
        "Couper le poulet en petits dés et le faire mariner dans un bol avec 3 cuillères à soupe d'huile d'olive, le paprika, le curry, du sel et du poivre. Placer au réfrigérateur 1h.",
        "Laver, épépiner et couper le poivron en petits dés, peler et émincer finement l'oignon.",
        "Dans une poêle légèrement huilée, faire revenir le poivron et l'oignon jusqu'à coloration, ajouter le concentré de tomate et le persil et mélanger. Ajouter ensuite le poulet avec la marinade et faire cuire sur feu doux jusqu'à ce que le poulet soit cuit.",
        "Couper les feuilles de brick en deux et procéder au premier pliage: ramener le bord arrondi vers le bord droit, afin d’avoir comme une bande de 7-8 cm de large. Dans le coin de l'arrondi déposer la préparation puis replier le coin gauche sur la garniture de sorte à faire un triangle, puis replier à nouveau de la même façon jusqu’à la fin de la feuille (s'il reste un petit bout de feuille à la fin du pliage couper au ciseau). Humecter d'un peu d'huile pour maintenir fermer le samoussa si besoin.",
        "Faire cuire les samoussas 10 minutes à 220°C dans un four préalablement préchauffé ou à la poêle sur feux doux en retournant régulièrement les samoussas jusqu'à ce qu'ils soient bien dorés."
      ]
    },
    {
      "id": "courgette_tarte",
      "name": "Tarte aux courgettes et lardons",
      "image": "/assets/salty-recipe/tarte_courgettes.jpg",
      "eventCategory": null,
      "category": ["plat"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "courgettes",
          "quantity": "2"
        },
        {
          "name": "pâte brisée",
          "quantity": "1"
        },
        {
          "name": "de lardons",
          "quantity": "200g"
        },
        {
          "name": "de curry",
          "quantity": "1 cc"
        },
        {
          "name": "sel",
          "quantity": ""
        },
        {
          "name": "poivre",
          "quantity": ""
        },
        {
          "name": "de lait ou de crème liquide",
          "quantity": "100ml"
        },
        {
          "name": "oeufs",
          "quantity": "2"
        }
      ],
      "prepTime": "25 min",
      "cookTime": "30 min",
      "steps": [
        "Préchauffer le four thermostat 7 (220°C).",
        "Faire rissoler les lardons et l'oignon dans une poêle, mélanger ensuite les rondelles de courgettes.",
        "Battre les oeufs et la crème, poivrer et ajouter le curry.",
        "Répartir le mélange de lardons, courgettes et oignons sur le fond de tarte, puis verser les oeufs battus et la crème mélangés, salés et poivrés.",
        "Cuire une demi-heure (retirer du four lorsque le dessus est bien doré)."
      ]
    },
    {
      "id": "courgette_viande_hachee",
      "name": "Courgettes à la viande hachée",
      "image": "/assets/salty-recipe/courgettes_bolognaise.jpg",
      "eventCategory": null,
      "category": ["plat", "rapide"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "courgette",
          "quantity": "1"
        },
        {
          "name": "persil",
          "quantity": ""
        },
        {
          "name": "poivre",
          "quantity": ""
        },
        {
          "name": "sel",
          "quantity": ""
        },
        {
          "name": "de gruyère râpé",
          "quantity": "50g"
        },
        {
          "name": "de viande hachée",
          "quantity": "500g"
        },
        {
          "name": "de coulis de tomates",
          "quantity": "400g"
        },
        {
          "name": "gousse d'ail",
          "quantity": "1"
        }
      ],
      "prepTime": "20 min",
      "cookTime": "20 min",
      "steps": [
        "Couper les courgettes en rondelles et les faire cuire 20 mn à la vapeur.",
        "Pendant ce temps, faire revenir 10 mn la viande hachée dans un peu de matière grasse. Ajouter le coulis de tomate, l'ail, le persil, le sel et le poivre. Laisser cuire encore 5 mn.",
        "Mélanger le tout. Saupoudrer de gruyère râpé.",
        "Peut s'accompagner de pâtes."
      ]
    },
    {
      "id": "soupe_courgette_curry",
      "name": "Soupe à la courgette et au curry",
      "image": "/assets/salty-recipe/soupe à la courgette et au curry.jpg",
      "eventCategory": "winter",
      "category": ["entrée", "rapide"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de courgette",
          "quantity": "1 kg"
        },
        {
          "name": "oignon",
          "quantity": "1"
        },
        {
          "name": "curry",
          "quantity": ""
        },
        {
          "name": "poivre",
          "quantity": ""
        },
        {
          "name": "sel",
          "quantity": ""
        },
        {
          "name": "huile",
          "quantity": ""
        },
        {
          "name": "de pommes de terre",
          "quantity": "300 g"
        },
        {
          "name": "gousse d'ail",
          "quantity": "1"
        },
        {
          "name": "bouillon de volaille",
          "quantity": "1 cube"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "30 min",
      "steps": [
        "Découpez en cubes les courgettes et les pommes de terre épluchées. Coupez les oignons grossièrement.",
        "Préparez du bouillon de volaille (frais ou lyophilisé).",
        "Dans une cocotte, faites chauffez 2 cuillères à soupe d'huile. Quand celle ci est bien chaude, versez les oignons et l'ail et saupoudrez de curry.",
        "Remuez constamment, le temps que les oignons s'imprègnent de curry. Versez 1 l d'eau (y compris le bouillon).",
        "Ajoutez les pommes de terre et 5 à 10 mn plus tard, les dés de courgettes.",
        "Laissez cuire 20 min. La soupe ne doit pas bouillir. Salez et poivrez.",
        "Mixez (de préférence le plus possible, cette soupe est meilleure lisse). C'est prêt!"
      ]
    },
    {
      "id": "gateau_chocolat_miel_courgette",
      "name": "Gâteau au chocolat (avec miel et courgettes)",
      "image": "/assets/sugar-recipe/gateau_chocolat_sans_beurre.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de chocolat",
          "quantity": "200 g"
        },
        {
          "name": "",
          "quantity": "180 g de courgettes cuites et mixées"
        },
        {
          "name": "miel",
          "quantity": "60 g"
        },
        {
          "name": "de farine",
          "quantity": "100 g"
        },
        {
          "name": "de levure",
          "quantity": "1 sachet"
        },
        {
          "name": "oeufs",
          "quantity": "3"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "30 min",
      "steps": [
        "Faire cuire les courgettes coupées en morceaux dans de l'eau bouillante durant 12 minutes puis les égoutter et les mixer.",
        "Préchauffer le four à 180°C (thermostat 6).",
        "Faire fondre le chocolat puis y ajouter les courgettes.",
        "Pendant ce temps, mélanger les œufs et le miel.",
        "Y incorporer le mélange chocolat/courgettes, puis la farine et la levure.",
        "Faire cuire 30 minutes au four dans un moule avec du papier cuisson au fond."
      ]
    },
    {
      "id": "muffins_au_chorizo",
      "image": "/assets/salty-recipe/muffins-au-chorizo.jpg",
      "name": "Muffins au chorizo",
      "eventCategory": null,
      "category": ["aperitif"],
      "servingSize": "10",
      "prepTime": "30 min",
      "cookTime": "25 min",
      "sections": [
        {
          "name": "Garniture",
          "ingredients": [
            {
              "name": "poivron",
              "quantity": "1"
            },
            {
              "name": "d'huile d'olive",
              "quantity": "2 c.à.s"
            },
            {
              "name": "poivre",
              "quantity": null
            },
            {
              "name": "sel",
              "quantity": null
            },
            {
              "name": "de chorizo fort",
              "quantity": "200 g"
            },
            {
              "name": "d'ail",
              "quantity": "4 gousses"
            }
          ],
          "steps": [
            "Couper le poivron en petits dés. Dans une poêle, le faire fondre à feu moyen dans l'huile d'olive.",
            "Pendant ce temps, couper le chorizo en rondelles puis en dés. Réserver.",
            "Peler et couper les gousses d'ail en petits morceaux. Les ajouter aux dés de poivrons. Assaisonner et continuer la cuisson à feu doux pour faire suer et ramollir l'ail."
          ]
        },
        {
          "name": "Pâte",
          "ingredients": [
            {
              "name": "de farine",
              "quantity": "250 g"
            },
            {
              "name": "de levure chimique",
              "quantity": "1 sachet"
            },
            {
              "name": "de sel",
              "quantity": "1 pincée"
            },
            {
              "name": "oeufs",
              "quantity": "3"
            },
            {
              "name": "de lait",
              "quantity": "10 cl"
            },
            {
              "name": "d'huile de tournesol",
              "quantity": "10 cl"
            }
          ],
          "steps": [
            "Préparer la pâte : mélanger la farine au sachet de levure. Battre les oeufs, rajouter le lait, l'huile et la farine en pluie. Saler.",
            "La pâte doit être légèrement épaisse : rectifier avec un peu de farine ou d'eau selon le résultat.",
            "Quand la garniture est cuite, bien la mélanger à la pâte, avec le chorizo. Remplir les moules à muffins aux 2/3. Cuire au four à 180°C (thermostat 6) pendant 25 min."
          ]
        }
      ]
    },
    {
      "id": "pommes_de_terre_gros_sel",
      "name": "Pommes de terre au gros sel",
      "image": "/assets/salty-recipe/pommes-de-terre-gros-sel.jpg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "4",
      "ingredients": [
        {
          "name": "pommes de terre pour cuisson au four",
          "quantity": "8"
        },
        {
          "name": "de beurre",
          "quantity": "100g"
        },
        {
          "name": "Gros sel",
          "quantity": null
        }
      ],
      "prepTime": "5 min",
      "cookTime": "50 min",
      "difficulty": "Facile",
      "steps": [
        "Lavez et brossez les pommes de terre.",
        "Dans un four préchauffé à 180°C (th.6), faites-les cuire sur un lit de gros sel pendant 50 minutes environ. Ajustez le temps de cuisson selon la taille des pommes de terre. En fin de cuisson, la pointe d'un couteau doit s'enfoncer facilement et la peau doit être croustillante.",
        "Une fois les pommes de terre cuites, coupez-les en deux dans le sens de la longueur après les avoir débarrassées de l'excédent de sel.",
        "Servez-les avec une noisette de beurre."
      ]
    },
    {
      "id": "mousse_chocolat",
      "name": "Mousse au chocolat",
      "image": "/assets/sugar-recipe/mousse-chocolat.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de chocolat noir",
          "quantity": "200g"
        },
        {
          "name": "œufs",
          "quantity": "6"
        },
        {
          "name": "Sel",
          "quantity": "1 pincée"
        },
        {
          "name": "Copeaux de chocolat (facultatif)"
        }
      ],
      "prepTime": "20 min",
      "cookTime": null,
      "steps": [
        "Séparez les jaunes des blancs d’œufs.",
        "Briser le chocolat en morceaux et le mettre dans un bol. Faites-le fondre au bain-marie. Mélangez jusqu'à obtenir une consistance lisse sans grumeaux. Laissez refroidir un peu.",
        "Ajoutez les jaunes d’œufs au chocolat fondu et mélangez bien.",
        "Battez les blancs d’œufs avec une pincée de sel jusqu'à ce qu'ils deviennent fermes.",
        "Incorporez doucement les blancs d’œufs au mélange de chocolat et de jaunes d’œufs. Veillez à ne pas trop mélanger pour éviter de liquéfier la préparation.",
        "Répartissez la préparation équitablement dans 6 ramequins ou verrines.",
        "Placez les ramequins au réfrigérateur pendant au moins 3 heures pour que la mousse prenne.",
        "Pour une présentation plus élégante, vous pouvez saupoudrer les mousses de copeaux de chocolat (faites à l'aide d'un économe, assurez-vous que le chocolat soit bien froid)."
      ]
    },
    {
      "id": "tarte_miel_amande",
      "image": "/assets/sugar-recipe/tarte-miel-amande.jpg",
      "name": "Tarte miel et amande",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "8",
      "prepTime": "1 h 30 min",
      "cookTime": "40 min",
      "sections": [
        {
          "name": "Pâte sucrée",
          "ingredients": [
            {
              "name": "de farine T55",
              "quantity": "200g"
            },
            {
              "name": "de beurre",
              "quantity": "110g"
            },
            {
              "name": "de sucre glace",
              "quantity": "70g"
            },
            {
              "name": "de poudre d’amandes",
              "quantity": "20g"
            },
            {
              "name": "Sel",
              "quantity": "1 pincée"
            },
            {
              "name": "œuf",
              "quantity": "1"
            },
            {
              "name": "zeste de citron",
              "quantity": "1"
            }
          ],
          "steps": [
            "Mélangez tous les ingrédients pour la pâte sucrée.Puis laissez reposer dans du film une heure au réfrigérateur.",
            "Foncez un moule à tarte à fond amovible avec la pâte sucrée.",
            "Préchauffez le four à 160 °C. Piquez le fond de la pâte à l'aide d'une fourchette pour éviter qu'elle gonfle. Faites cuire la pâte à blanc pendant 20 minutes."
          ]
        },
        {
          "name": "Garniture",
          "ingredients": [
            {
              "name": "de sucre blond de canne",
              "quantity": "100g"
            },
            {
              "name": "d’amandes effilées",
              "quantity": "165g"
            },
            {
              "name": "de beurre",
              "quantity": "120g"
            },
            {
              "name": "de miel",
              "quantity": "100g"
            },
            {
              "name": "de crème épaisse",
              "quantity": "50g"
            },
            {
              "name": "de cranberries séchées",
              "quantity": "100g"
            }
          ],
          "steps": [
            "Mettez tous les ingrédients de la garniture dans une casserole puis portez à ébullition.",
            "Versez ensuite l’appareil dans le fond de tarte précuit et enfournez à nouveau pour 20 minutes.",
            "La tarte est cuite lorsqu’elle est légèrement dorée. Laissez refroidir avant de couper et de déguster."
          ]
        }
      ]
    },
    {
      "id": "couscous",
      "name": "Couscous poulet et merguez",
      "image": "/assets/salty-recipe/couscous.jpg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "6",
      "ingredients": [
        {
          "name": "merguez",
          "quantity": "12"
        },
        {
          "name": "Huile d'olive",
          "quantity": null
        },
        {
          "name": "de harissa",
          "quantity": "1 cc"
        },
        {
          "name": "cubes de bouillon de boeuf",
          "quantity": "2"
        },
        {
          "name": "tomates",
          "quantity": "3"
        },
        {
          "name": "carottes",
          "quantity": "5"
        },
        {
          "name": "courgettes",
          "quantity": "2"
        },
        {
          "name": "de pois chiches",
          "quantity": "400g"
        },
        {
          "name": "pilons de poulet (fermier de préférence)",
          "quantity": "8"
        },
        {
          "name": "de concentré de tomates",
          "quantity": "2 boîtes"
        },
        {
          "name": "d'épices à couscous",
          "quantity": "3 CS"
        },
        {
          "name": "navets",
          "quantity": "2"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "55 min",
      "steps": [
        "Lavez et épluchez les carottes, les navets et les tomates et les couper en cubes.",
        "Dans une cocotte, versez 3 cuillères à soupe d'huile d'olive. Mettez à chauffer et faites-y dorer les pilons de poulet. Quand ils sont dorés, versez l'équivalent d'1 litre d'eau et ajouter les cubes de bouillon de boeuf, le concentré de tomate, les carottes, navets et tomates, les épices à couscous et l'harissa.",
        "Compter 45 mn de cuisson à couvert.",
        "En attendant, lavez et coupez les courgettes en cubes et égouttez les pois chiches.",
        "Une fois les 45 mn écoulées, ouvrez et rajouter les courgettes et les pois chiches.",
        "Remettez au feu : comptez 20 mn de cuisson supplémentaire.",
        "Faites cuire vos merguez sur un grill ou à la poêle, mais pas avec les légumes.",
        "Servez accompagné d'une semoule fine."
      ]
    },
    {
      "id": "poulet_antillais",
      "name": "Poulet antillais (à l'ananas)",
      "image": "/assets/salty-recipe/poulet-ananas.jpg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "4",
      "ingredients": [
        {
          "name": "oignon",
          "quantity": "1"
        },
        {
          "name": "de beurre",
          "quantity": "20 g"
        },
        {
          "name": "cuisses de poulet",
          "quantity": "4"
        },
        {
          "name": "ananas",
          "quantity": "200g"
        },
        {
          "name": "muscade",
          "quantity": null
        },
        {
          "name": "citron",
          "quantity": "0.5"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "1 h",
      "steps": [
        "Dans une sauteuse, faire revenir dans le beurre le gros oignon haché.",
        "Les faire légèrement dorer, puis incorporer les cuisses de poulet. Laisser dorer les cuisses pour quelles prennent une belle couleur à feu moyen, puis baisser le feu pour cuire les cuisses à l'intérieur.",
        "Couvrir et laisser mijoter 45 mn, vérifier toutes les 5 mn.",
        "Ajouter ensuite l'ananas coupé en morceaux, puis cuire 5 mn à feu doux.",
        "Incorporer la muscade et le jus du citron sur les cuisses, laisser mijoter pendant 40 mn à feu doux.",
        "Servir bien chaud, avec du riz parfumé à la noix de coco."
      ]
    },
    {
      "id": "frita",
      "name": "Frita",
      "image": "/assets/salty-recipe/frita.jpg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "6",
      "ingredients": [
        {
          "name": "tomates (mûres)",
          "quantity": "6"
        },
        {
          "name": "poivrons verts",
          "quantity": "4"
        },
        {
          "name": "poivre",
          "quantity": null
        },
        {
          "name": "sel",
          "quantity": null
        },
        {
          "name": "gousses d'ail",
          "quantity": "2"
        }
      ],
      "prepTime": "20 min",
      "cookTime": "1 h",
      "difficulty": "Facile",
      "steps": [
        "Couper les poivrons en petits morceaux, une fois nettoyés et débarrassés de leurs graines.",
        "Les faire revenir dans de l'huile d'olive à feu fort dans un faitout.",
        "Rajouter l'ail coupé très finement, remuer le tout pour roussir un peu. Baisser le feu et rajouter les tomates en petits morceaux (pelées si possible car c'est meilleur, après les avoir ébouillantées).",
        "Laisser mijoter le tout à feu très doux en couvrant un peu : plus on laisse mijoter, meilleur c'est(2 heures de cuisson à feu très doux c'est encore mieux!).",
        "Les légumes fondent, le temps de cuisson long est vraiment le secret de la réussite.",
        "Saler et poivrer à votre convenance.",
        "Cette préparation à base de légumes peut se manger en accompagnement d'une viande ou d'un poisson, de riz ou de semoule."
      ]
    },
    {
      "id": "saucisses_epicees",
      "name": "Rougail saucisses réunionnais",
      "image": "/assets/salty-recipe/rougail-saucisses.jpg",
      "category": ["plat"],
      "eventCategory": null,
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de saucisses",
          "quantity": "1 kg"
        },
        {
          "name": "d'huile",
          "quantity": "3 CS"
        },
        {
          "name": "gros oignons émincés",
          "quantity": "2"
        },
        {
          "name": "d'ail",
          "quantity": "2 gousses"
        },
        {
          "name": "Gingembre",
          "quantity": null
        },
        {
          "name": "tomates hachées finement",
          "quantity": "5"
        },
        {
          "name": "de thym",
          "quantity": "1 branche"
        },
        {
          "name": "de curcuma",
          "quantity": "2 pincées"
        },
        {
          "name": "Piment fort ou 1 pincée de piment en poudre de Cayenne selon votre goût",
          "quantity": "1"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "30 min",
      "steps": [
        "Dans une cocotte, faites dorer les oignons avec l'huile et ajoutez les saucisses coupées en morceaux.",
        "Puis ajoutez l'ail, le gingembre et les tomates. Mélangez bien.",
        "Ajoutez le thym et le curcuma, plus le piment et un petit peu d'eau.",
        "Couvrez et laissez cuire à feu doux pendant 1/2 heure environ.",
        "La sauce devra être très rouge et épaisse, ce qui indiquera la fin de la cuisson."
      ]
    },
    {
      "id": "cocos_paimpol_tomate",
      "name": "Cocos de Paimpol à la tomate",
      "image": "/assets/salty-recipe/haricots-blancs-sauce-tomate.jpg",
      "eventCategory": "winter",
      "category": ["plat"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "d'haricots coco de Paimpol écossés",
          "quantity": "500g"
        },
        {
          "name": "d'huile d’olive",
          "quantity": "2 cuillères à soupe"
        },
        {
          "name": "oignon",
          "quantity": "1"
        },
        {
          "name": "gousses d’ail",
          "quantity": "2"
        },
        {
          "name": "tomates",
          "quantity": "2"
        },
        {
          "name": "de céleri branche",
          "quantity": "1 brin"
        },
        {
          "name": "de curcuma",
          "quantity": "1 pincée"
        },
        {
          "name": "de thym",
          "quantity": "3 brins"
        },
        {
          "name": "de laurier",
          "quantity": "2 feuilles"
        },
        {
          "name": "d'eau",
          "quantity": "700ml"
        },
        {
          "name": "de sel",
          "quantity": "1 pincée"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "45 min",
      "steps": [
        "Ecossez les haricots, rincez les cocos sous l’eau froide et égouttez-les.",
        "Pelez l’oignon et les gousses d’ail, et coupez-les en dés. Lavez les tomates, pelez-les et coupez-les également en dés.",
        "Ôtez les extrémités de la branche de céleri, lavez-la puis ciselez-la. Lavez le thym et le laurier.",
        "Versez l’huile d’olive dans une cocotte. Faites la chauffer puis, quand elle est chaude, ajoutez les cubes d’ail, d’oignon et de céleri.",
        "Laissez cuire 5 minutes en remuant de temps en temps puis ajoutez les tomates, le thym, le laurier et la pincée de curcuma.",
        "Mélangez et laissez légèrement compoter 5 minutes.",
        "Ajoutez ensuite les cocos égouttés et mouillez avec 700 ml d’eau.",
        "Portez à ébullition et faites cuire 30 minutes à frémissement (comptez les 30 minutes à partir du moment où cela bout).",
        "Au bout de 30 minutes, salez puis laissez cuire 10 minutes de plus.",
        "Astuces : Ne pas saler l’eau de cuisson, cela durcit les légumes secs.",
        "Saler environ 10 minutes avant la fin de la cuisson.",
        "Ajouter l’ingrédient qui  les rend plus digestes : une pincée de bicarbonate alimentaire."
      ]
    },
    {
      "id": "coco_paimpol_saucisse",
      "name": "Cocos de Paimpol à la saucisse",
      "image": "/assets/salty-recipe/haricots-blancs-saucisse.jpg",
      "eventCategory": null,
      "category": ["plat"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "d'oignon émincés",
          "quantity": "100g"
        },
        {
          "name": "de bouillon",
          "quantity": "250ml"
        },
        {
          "name": "de coulis de tomates",
          "quantity": "250g"
        },
        {
          "name": "de coco de paimpol",
          "quantity": "500g"
        },
        {
          "name": "d'ail",
          "quantity": "4 gousses"
        },
        {
          "name": "échalote",
          "quantity": "2"
        },
        {
          "name": "saucisses fumées",
          "quantity": "4"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "50 min",
      "steps": [
        "Faire rissoler à l'huile d'olive les oignons.",
        "Ajouter 4 ou 5 gousses d'ail et 2 échalotes, le tout épluchées et entières.",
        "Mettre les saucisses et les faire revenir quelques minutes.",
        "Ajouter le coulis de tomates et les cocos, poivrer.",
        "Ajouter de l'eau si nécessaire afin que le tout soit recouvert.",
        "Laisser cuire pendant 50 minutes à couvert.",
        "Astuces : - Vous pouvez ajouter quelques rondelles de chorizo en cours de cuisson",
        "- Ne pas saler l’eau de cuisson, cela durcit les légumes secs.",
        "- Ajouter le bouillon environ 10 minutes avant la fin de la cuisson.",
        "- Ajouter l’ingrédient qui  les rend plus digestes : une pincée de bicarbonate alimentaire."
      ]
    },
    {
      "id": "puree_patates_douces",
      "name": "Purée de patates douces",
      "image": "/assets/salty-recipe/puree-patates-douces.jpg",
      "eventCategory": "winter",
      "category": ["plat"],
      "servingSize": "4",
      "ingredients": [
        {
          "name": "de crème fraîche",
          "quantity": "20 cl"
        },
        {
          "name": "d'huile d'olive",
          "quantity": "1CS"
        },
        {
          "name": "de sel",
          "quantity": "1 pincée"
        },
        {
          "name": "de poivre ou piment de cayenne",
          "quantity": "1 pincée"
        },
        {
          "name": "d'orange ou de citron pour parfumer",
          "quantity": "1 zeste"
        },
        {
          "name": "de patate douce",
          "quantity": "800 g"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "10 min",
      "steps": [
        "Mettre une grande quantité d'eau à chauffer. Eplucher les patates douces et les couper en petits morceaux.",
        "Les faire cuire dans l'eau à ébullition pendant 10 min.",
        "Passer les patates cuites au mixer avec la crème et de l'huile d'olive à volonté.",
        "Saler poivrer et parfumer de zestes d'agrumes à volonté.",
        "Cette purée accompagne  toutes vos viandes et poissons un peu épicés."
      ]
    },
    {
      "id": "veloute_patates_douces_curry",
      "name": "Velouté de patates douces au curry",
      "image": "/assets/salty-recipe/veloute-patates-douces.jpg",
      "eventCategory": "winter",
      "category": ["soupe", "entrée"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "d'huile",
          "quantity": "1 CS"
        },
        {
          "name": "oignon coupé en fines tranches",
          "quantity": "1"
        },
        {
          "name": "de gingembre râpé (pas en poudre, c'est important pour le goût)",
          "quantity": "1 CS"
        },
        {
          "name": "de curry en poudre ",
          "quantity": "1 CS"
        },
        {
          "name": "de coriandre fraîche ciselée",
          "quantity": "1 petite poignée"
        },
        {
          "name": "d'ail écrasées",
          "quantity": "4 gousses"
        },
        {
          "name": "de patate douce pelées et coupées en petits cubes",
          "quantity": "1 kg"
        },
        {
          "name": "de bouillon de volaille",
          "quantity": "1 litre"
        },
        {
          "name": "de lait de coco",
          "quantity": "40 cl"
        }
      ],
      "prepTime": "10 min",
      "cookTime": "30 min",
      "steps": [
        "Faire revenir l'oignon quelques minutes dans l'huile.",
        "Ajouter l'ail, le gingembre et la poudre de curry. Remuer.",
        "Mettre les morceaux de patates douces dans ce mélange.",
        "Verser le bouillon.",
        "Porter à ébullition puis laisser mijoter à couvert pendant 20 à 30 min (jusqu'à ce que les patates soient cuites, vérifier avec la pointe d'un couteau).",
        "Enlever la casserole du feu.",
        "Laisser un peu refroidir.",
        "Mixer.",
        "Remettre sur le feu.",
        "Mettre le lait de coco et ajouter la coriandre ciselée (en garder pour mettre dans les bols au moment de servir, en décoration)."
      ]
    },
    {
      "id": "gratin_patates_douces_pommes_terre",
      "name": "Gratin de patates douces et pommes de terre",
      "image": "/assets/salty-recipe/gratin-patates-douces.jpg",
      "eventCategory": null,
      "category": ["plat"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "d'emmental râpé",
          "quantity": "40 g"
        },
        {
          "name": "poivre",
          "quantity": "1 pincée"
        },
        {
          "name": "sel",
          "quantity": "1 pincée"
        },
        {
          "name": "patates douces",
          "quantity": "4"
        },
        {
          "name": "pommes de terre",
          "quantity": "4"
        },
        {
          "name": "de crème liquide (épaisse de préférence)",
          "quantity": "20 cl"
        },
        {
          "name": "muscade",
          "quantity": "1 pincée"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "30 min",
      "steps": [
        "Éplucher et couper les pommes de terre et les patates douces.",
        "Les faire cuire dans de l'eau. Pour vérifier la cuisson, plonger un couteau dans les pommes de terre et dans les patates douces.",
        "Lorsqu'elles sont cuites, bien les égoutter.",
        "Préparer l'appareil avec la crème, le sel, le poivre et la muscade.",
        "Prendre un plat à gratin, y mettre les légumes, verser l'appareil dessus et l'emmental.",
        "Faire cuire le gratin à 180° (thermostat 6) pendant 30 min environ."
      ]
    },
    {
      "id": "tarte_aux_pommes",
      "name": "Tarte aux pommes",
      "image": "/assets/sugar-recipe/tarte-pommes.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "pâte brisée",
          "quantity": "1"
        },
        {
          "name": "de sucre vanillé",
          "quantity": "1 sachet"
        },
        {
          "name": "de beurre",
          "quantity": "30 g"
        },
        {
          "name": "pommes Golden",
          "quantity": "6"
        }
      ],
      "prepTime": "25 min",
      "cookTime": "30 min",
      "steps": [
        "Éplucher et découper en morceaux les pomme.",
        "Faire une compote : les mettre dans une casserole avec un peu d'eau (1 verre ou 2). Bien remuer. Quand les pommes commencent à ramollir, ajouter un sachet ou un sachet et demi de sucre vanillé. Ajouter un peu d'eau si nécessaire.",
        "Vous saurez si la compote est prête une fois que les pommes ne seront plus dures du tout. Ce n'est pas grave s'il reste quelques morceaux.",
        "Pendant que la compote cuit, éplucher et couper en quatre les deux dernières pommes, puis, couper les quartiers en fines lamelles (elles serviront à être posées sur la compote).",
        "Préchauffer le four à 210°C (thermostat 7).",
        "Laisser un peu refroidir la compote et étaler la pâte brisée dans un moule et la piquer avec une fourchette.",
        "Verser la compote sur la pâte et placer les lamelles de pommes en formant une spirale ou plusieurs cercles, au choix ! Disposer des lamelles de beurre dessus.",
        "Mettre au four et laisser cuire pendant 30 min. Surveiller la cuisson. Vous pouvez ajouter un peu de sucre vanillé sur la tarte pendant que çà cuit pour caraméliser un peu."
      ]
    },
    {
      "id": "gaufres",
      "name": "Gaufres",
      "image": "/assets/sugar-recipe/gaufres.jpg",
      "eventCategory": null,
      "category": ["dessert"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "de farine",
          "quantity": "250g"
        },
        {
          "name": "de levure chimique",
          "quantity": "1 sachet"
        },
        {
          "name": "de sucre",
          "quantity": "40g"
        },
        {
          "name": "oeufs",
          "quantity": "2"
        },
        {
          "name": "de lait",
          "quantity": "50cl"
        },
        {
          "name": "de beurre fondu",
          "quantity": "100g"
        },
        {
          "name": "de sel",
          "quantity": "1 pincée"
        }
      ],
      "prepTime": "15 min",
      "cookTime": "30 min",
      "steps": [
        "Mélangez la farine, la levure et le sucre.",
        "Ajoutez les œufs battus et mélangez bien.",
        "Ajoutez peu à peu le lait, en remuant avec un fouet, pour éviter les grumeaux.",
        "Incorporez le beurre fondu, une pincée de sel et mélangez bien.",
        "Laissez reposer la pâte à gaufres 1h au réfrigérateur avant de les cuire (la pâte sera plus épaisse mais celle-ci restera liquide).",
        "Confectionnez les gaufres dans un gaufrier chauffé, en les cuisant 3 à 5 minutes."
      ]
    },
    {
      "id": "shumpot",
      "name": "Shumpot",
      "image": "/assets/sugar-recipe/shumpot(2).jpg",
      "eventCategory": null,
      "category": ["plat"],
      "servingSize": "6",
      "ingredients": [
        {
          "name": "farine",
          "quantity": "450g"
        },
        {
          "name": "œufs",
          "quantity": "2"
        },
        {
          "name": "yaourt nature",
          "quantity": "1"
        },
        {
          "name": "crème fraîche",
          "quantity": "20 cl"
        },
        {
          "name": "de vergeoise brune",
          "quantity": "1/2 paquet"
        },
        {
          "name": "beurre",
          "quantity": "100g"
        },

        {
          "name": "raisins secs",
          "quantity": "1 poignée"
        }
      ],
      "prepTime": "30 min",
      "cookTime": "30 min",
      "steps": [
        "Faire bouillir l'eau dans une gamelle.",
        "Dans un saladier, faire un puit avec la farine, ajouter les œufs, le yaourt nature et la crème fraîche.",
        "Mélanger un peu (1 mn). Il faut juste incorporer les ingrédients, ne pas travailler la pâte.",
        "Puis fariner le torchon. Mettre la pâte sur le torchon.",
        "Étaler la pâte avec les mains préalablement farinées.",
        "Attention à ne pas mettre de farine sur les bords de la pâte.",
        "Ajouter le sucre au centre de la pâte étalée.",
        "Recouvrir le sucre de lamelles de beurre. Ajouter les raisins.",
        "Fermer la pâte grâce au torchon (un côté, puis l'autre). Il faut que le sucre soit bien recouvert. Rabattre les bouts de chaque côté le plus haut possible sur le dessus du 'boudin'.",
        "Refermer le torchon (le 'boudin' doit être bien serré).",
        "Reserrer la pâte grâce au torchon (un côté, puis l'autre) rabattre le torchon le plus haut possible sur le dessus.",
        "Le 'boudin' doit être bien serré. Refermer le torchon sur le 'boudin' en tournant ce dernier, en alternant dessus, dessous, dessus ... La jointure du shumpot doit être au dessus une fois qu'il est fermé avec le torchon.",
        "Ficeler les coins le plus raz possible du 'boudin' (comme un bonbon)",
        "Mettre le shumpot dans l'eau bouillante. Cuisson : 45 minutes environ.",
        "Astuce : Se déguste à merveille le lendemain, réchauffé à la poêle, en ajoutant de la vergeoise brune."
      ]
    }
  ]
}
